let visgraph = null;//定义全局变量-图可视化对象
let currentLayout=null; //当前布局算法类型
let loopName=null; //循环计数器
$(function(){

	//1、在指定canvas元素上初始化图对象
	visgraph = initVisGraph('graph-panel'); 	

	//2、模拟加载服务端数据，可视化显示
	var data = loadData(); 
	visgraph.drawData(data);

	//自动缩放居中显示
	visgraph.setZoom('auto');

	//3、根据需要自定义显示样式
	definedGraphStyle();

	//以下为 生成右侧操作栏，用于演示各种操作

	initLayoutOptions();//生成右侧的布局算法操作区

	bindLayoutBtnEvent(); //绑定布局算法运行、停止、应用的点击事件

	initClusterOptions();//聚类算法操作下拉

	resetShowStyleEvent();//显示设置事件绑定

	bindLeftBarEvent();//绑定左侧工具栏操作事件

	bindSwitchDataEvent();//切换示例数据的事件绑定

	mockInteractiveData();//演示动态添加数据

	commonOperateEvent();//常用操作的操作事件
});

//示例数据集，用于演示使用
const DemoDataCache = {
	data1:{"nodes":[{"id":"上海米哈游网络科技股份","x":1129,"y":-1378,"color":"143,147,4"},{"id":"上海游族信息技术","x":1736,"y":2192,"color":"203,205,142"},{"id":"苏州齐思妙想信息科技","x":425,"y":1936,"color":"54,42,188"},{"id":"上海数龙科技","x":-108,"y":715,"color":"70,75,199"},{"id":"芜湖乐时网络科技","x":1638,"y":-630,"color":"146,172,154"},{"id":"玩心（上海）网络科技","x":-685,"y":-1635,"color":"122,237,24"},{"id":"上海寒诀网络科技","x":-324,"y":-2144,"color":"53,24,9"},{"id":"上海弘贯网络科技","x":-400,"y":-648,"color":"164,216,13"},{"id":"上海鹰狮互娱科技","x":-160,"y":2897,"color":"169,150,62"},{"id":"江苏易乐网络科技","x":2301,"y":130,"color":"164,152,137"},{"id":"骨迪（上海）网络科技","x":-137,"y":-1600,"color":"33,159,135"},{"id":"上海天赐之恒网络科技","x":-1345,"y":-766,"color":"15,42,83"},{"id":"上海鹰角网络科技","x":3254,"y":865,"color":"152,90,21"},{"id":"上海番糖网络科技","x":135,"y":-2326,"color":"55,194,70"},{"id":"盛趣信息技术（上海）","x":74,"y":917,"color":"236,216,3"},{"id":"上海红月网络科技","x":-1179,"y":1028,"color":"181,14,172"},{"id":"拾梦文化发展（上海）","x":-823,"y":186,"color":"209,99,236"},{"id":"上海布鲁潘达网络技术","x":351,"y":-758,"color":"3,253,6"},{"id":"杭州浩游科技","x":3084,"y":1724,"color":"71,127,153"},{"id":"上海慕和网络科技","x":1682,"y":-1432,"color":"89,153,139"},{"id":"上海游唐网络技术","x":626,"y":91,"color":"95,55,184"},{"id":"浙江九翎网络科技","x":-925,"y":1381,"color":"102,116,39"},{"id":"上海悠星网络科技","x":3220,"y":700,"color":"154,0,119"},{"id":"上海散爆网络科技","x":1712,"y":-314,"color":"213,220,227"},{"id":"杭州心光流美网络科技","x":2622,"y":-1375,"color":"194,198,1"},{"id":"杭州掌派科技","x":519,"y":-920,"color":"79,97,83"},{"id":"上海墨灿网络科技","x":1700,"y":1097,"color":"185,180,159"},{"id":"上海骏梦网络科技","x":-1775,"y":881,"color":"47,127,171"},{"id":"上海久游网络科技","x":2566,"y":2100,"color":"40,50,75"},{"id":"上海铂漫网络科技","x":-838,"y":-1892,"color":"18,74,117"},{"id":"上海焦扬网络科技","x":-1809,"y":-604,"color":"64,58,252"},{"id":"哈游文化传媒（上海）","x":1169,"y":-1181,"color":"143,147,4"},{"id":"米哈游科技（上海）","x":1325,"y":-1387,"color":"143,147,4"},{"id":"上海吼美科技","x":942,"y":-1303,"color":"143,147,4"},{"id":"上海米哈游天命科技","x":939,"y":-1440,"color":"143,147,4"},{"id":"霍尔果斯圣芙蕾雅科技","x":1030,"y":-1201,"color":"143,147,4"},{"id":"上海交宅科技","x":1162,"y":-1580,"color":"143,147,4"},{"id":"上海羽渡尘科技","x":1031,"y":-1552,"color":"143,147,4"},{"id":"上海米哈游影铁科技","x":1278,"y":-1520,"color":"143,147,4"},{"id":"上海米哈游重装小兔科技","x":1286,"y":-1243,"color":"143,147,4"},{"id":"上海游豪信息技术","x":1698,"y":2368,"color":"203,205,142"},{"id":"上海游家信息技术","x":1948,"y":2147,"color":"203,205,142"},{"id":"上海游娱信息技术","x":1922,"y":2338,"color":"203,205,142"},{"id":"南京游族信息技术","x":1483,"y":2137,"color":"203,205,142"},{"id":"苏州游族信息技术","x":1673,"y":1964,"color":"203,205,142"},{"id":"上海驰游信息技术","x":1575,"y":2098,"color":"203,205,142"},{"id":"上海游族互娱网络科技","x":1924,"y":2052,"color":"203,205,142"},{"id":"成都游族信息技术","x":1600,"y":2408,"color":"203,205,142"},{"id":"上海游梅信息技术","x":1769,"y":1950,"color":"203,205,142"},{"id":"上海游辰信息技术","x":1573,"y":1996,"color":"203,205,142"},{"id":"重庆游族互娱网络科技","x":1951,"y":2247,"color":"203,205,142"},{"id":"上海完游网络技术","x":1751,"y":2449,"color":"203,205,142"},{"id":"上海猫游网络科技","x":1499,"y":2239,"color":"203,205,142"},{"id":"北京嘉智游时投资中心（有限合伙）","x":1845,"y":2396,"color":"203,205,142"},{"id":"上海鹿扬网络科技","x":1542,"y":2322,"color":"203,205,142"},{"id":"北京厚德众合咨询中心（有限合伙）","x":1849,"y":1994,"color":"203,205,142"},{"id":"苏州齐思妙想孵化器管理","x":474,"y":1779,"color":"54,42,188"},{"id":"深圳中科启明股权投资基金合伙企业（有限合伙）","x":260,"y":1883,"color":"54,42,188"},{"id":"天津盛景贸易","x":-401,"y":858,"color":"70,75,199"},{"id":"天津游吉科技","x":-60,"y":401,"color":"70,75,199"},{"id":"宁夏智捷付电子支付服务","x":-314,"y":630,"color":"70,75,199"},{"id":"盐城市盛境网络科技","x":-434,"y":644,"color":"70,75,199"},{"id":"宁夏数龙科技网络","x":-394,"y":545,"color":"70,75,199"},{"id":"上海盛页信息科技","x":67,"y":648,"color":"70,75,199"},{"id":"喀什盛启信息科技","x":-322,"y":934,"color":"70,75,199"},{"id":"成都游吉科技","x":-285,"y":825,"color":"70,75,199"},{"id":"南京数龙计算机科技","x":-200,"y":897,"color":"70,75,199"},{"id":"上海灵游科技","x":-445,"y":754,"color":"70,75,199"},{"id":"上海宁乐科技","x":-138,"y":512,"color":"70,75,199"},{"id":"郑州聚凡网络技术","x":-151,"y":388,"color":"70,75,199"},{"id":"上海秋千软件科技","x":129,"y":568,"color":"70,75,199"},{"id":"上海炽宇网络科技","x":-339,"y":733,"color":"70,75,199"},{"id":"上海盛多网络科技","x":109,"y":478,"color":"70,75,199"},{"id":"北京众诚协作科技开发","x":-330,"y":465,"color":"70,75,199"},{"id":"上海维莱信息科技","x":-16,"y":528,"color":"70,75,199"},{"id":"成都锦天科技发展有限责任公司","x":29,"y":425,"color":"70,75,199"},{"id":"成都星漫科技","x":-246,"y":547,"color":"70,75,199"},{"id":"成都锦龙科技","x":-240,"y":421,"color":"70,75,199"},{"id":"海南妙酷网络科技","x":1660,"y":-802,"color":"146,172,154"},{"id":"杭州乐港科技","x":1789,"y":-531,"color":"146,172,154"},{"id":"芜湖蟠龙网络科技","x":1500,"y":-743,"color":"146,172,154"},{"id":"北京冠智信息技术","x":-853,"y":-1655,"color":"122,237,24"},{"id":"上海乌普斯文化创意","x":-479,"y":-2069,"color":"53,24,9"},{"id":"上海竹墨网络科技","x":-155,"y":-2156,"color":"53,24,9"},{"id":"上海寒跃影视文化","x":-311,"y":-1969,"color":"53,24,9"},{"id":"霍尔果斯弘贯网络科技","x":-660,"y":-575,"color":"164,216,13"},{"id":"广州明动网游网络科技","x":-538,"y":-882,"color":"164,216,13"},{"id":"广州易博网游网络科技","x":-577,"y":-452,"color":"164,216,13"},{"id":"广州暄武网络科技","x":-126,"y":-584,"color":"164,216,13"},{"id":"广州玖霄网游网络科技","x":-300,"y":-811,"color":"164,216,13"},{"id":"海南暄武网络科技","x":-521,"y":-784,"color":"164,216,13"},{"id":"海南创超网络科技","x":-558,"y":-546,"color":"164,216,13"},{"id":"海南侠游网络科技","x":-630,"y":-777,"color":"164,216,13"},{"id":"海南朱雀网络科技","x":-330,"y":-910,"color":"164,216,13"},{"id":"海南明动网络科技","x":-400,"y":-450,"color":"164,216,13"},{"id":"海南弘贯网络科技","x":-482,"y":-398,"color":"164,216,13"},{"id":"海南爱萌网络科技","x":-204,"y":-834,"color":"164,216,13"},{"id":"海南逗爱玩网络科技","x":-219,"y":-442,"color":"164,216,13"},{"id":"海南虾投网络科技","x":-430,"y":-889,"color":"164,216,13"},{"id":"海南有乾网络科技","x":-201,"y":-665,"color":"164,216,13"},{"id":"海南鹿头网络科技","x":-319,"y":-395,"color":"164,216,13"},{"id":"海南伐彩网络科技","x":-228,"y":-533,"color":"164,216,13"},{"id":"广州创超网络科技","x":-638,"y":-675,"color":"164,216,13"},{"id":"广州朱雀网络科技","x":-143,"y":-741,"color":"164,216,13"},{"id":"上海连娱网络科技","x":-328,"y":2877,"color":"169,150,62"},{"id":"北京星火互娱科技","x":2240,"y":-61,"color":"164,152,137"},{"id":"镇江傲游网络科技","x":2333,"y":-61,"color":"164,152,137"},{"id":"霍尔果斯飓风网络科技","x":2117,"y":63,"color":"164,152,137"},{"id":"上海业巧企业管理咨询","x":2162,"y":-14,"color":"164,152,137"},{"id":"上海宜儒企业管理咨询","x":2422,"y":-20,"color":"164,152,137"},{"id":"广州铭侠网络科技","x":2471,"y":230,"color":"164,152,137"},{"id":"镇江嘻游网络科技","x":2308,"y":321,"color":"164,152,137"},{"id":"镇江乐韵网络科技","x":2403,"y":295,"color":"164,152,137"},{"id":"北京文易电竞文化传媒","x":2143,"y":245,"color":"164,152,137"},{"id":"北京八爪鱼互娱科技","x":2482,"y":55,"color":"164,152,137"},{"id":"广州火凤网络科技","x":2501,"y":146,"color":"164,152,137"},{"id":"海南玩的溜网络科技","x":2109,"y":157,"color":"164,152,137"},{"id":"杭州西钺网络科技","x":2214,"y":304,"color":"164,152,137"},{"id":"上海至玩领域网络科技","x":-186,"y":-1762,"color":"33,159,135"},{"id":"上海构堂网络科技","x":28,"y":-1637,"color":"33,159,135"},{"id":"杭州天巽网络科技","x":-1489,"y":-874,"color":"15,42,83"},{"id":"上海白神企业管理","x":3301,"y":1070,"color":"152,90,21"},{"id":"上海木鸢网络科技","x":3409,"y":978,"color":"152,90,21"},{"id":"霍尔果斯鹰角网络科技","x":3172,"y":1030,"color":"152,90,21"},{"id":"上海彼方网络科技","x":3427,"y":802,"color":"152,90,21"},{"id":"上海番果网络科技","x":97,"y":-2165,"color":"55,194,70"},{"id":"上海鸿利数码科技","x":275,"y":835,"color":"236,216,3"},{"id":"天津盛启信息技术","x":-96,"y":1007,"color":"236,216,3"},{"id":"上海盛鹏信息技术","x":122,"y":1120,"color":"236,216,3"},{"id":"上海盛展网络科技","x":-50,"y":1227,"color":"236,216,3"},{"id":"无锡盛趣知识产权运营中心","x":298,"y":706,"color":"236,216,3"},{"id":"宜春盛趣信息技术","x":200,"y":745,"color":"236,216,3"},{"id":"上饶县志存投资中心（有限合伙）","x":356,"y":1082,"color":"236,216,3"},{"id":"深圳盛众科技","x":297,"y":1155,"color":"236,216,3"},{"id":"上海摩凡网络科技","x":397,"y":893,"color":"236,216,3"},{"id":"上海麦石信息技术","x":125,"y":1251,"color":"236,216,3"},{"id":"广州奥兹软件科技发展","x":279,"y":953,"color":"236,216,3"},{"id":"深圳市悠游数码科技","x":-173,"y":1080,"color":"236,216,3"},{"id":"上海时迈信息技术","x":-15,"y":1102,"color":"236,216,3"},{"id":"北京达意之都文化传播","x":212,"y":1202,"color":"236,216,3"},{"id":"北京锋盛时代科技","x":41,"y":1210,"color":"236,216,3"},{"id":"上海因菲尼迪网络科技发展","x":373,"y":788,"color":"236,216,3"},{"id":"上海大秦信息技术","x":-125,"y":1164,"color":"236,216,3"},{"id":"石家庄海澜网络游戏开发有限责任公司","x":385,"y":992,"color":"236,216,3"},{"id":"上海蓝田信息科技","x":224,"y":1062,"color":"236,216,3"},{"id":"霍尔果斯绯夜网络科技","x":-1302,"y":913,"color":"181,14,172"},{"id":"上海雷笛网络科技","x":-1327,"y":1127,"color":"181,14,172"},{"id":"拾梦网络科技（海南）","x":-917,"y":341,"color":"209,99,236"},{"id":"拾萌文化发展（上海）","x":-739,"y":33,"color":"209,99,236"},{"id":"上海优富广告","x":283,"y":-922,"color":"3,253,6"},{"id":"嘉兴智敏软件科技","x":3176,"y":1580,"color":"71,127,153"},{"id":"北京盛娱时代科技","x":1774,"y":-1272,"color":"89,153,139"},{"id":"上海慕明网络科技","x":1859,"y":-1432,"color":"89,153,139"},{"id":"上海行星网络科技","x":1646,"y":-1605,"color":"89,153,139"},{"id":"上海修真网络科技","x":1608,"y":-1266,"color":"89,153,139"},{"id":"上海科奂信息科技","x":730,"y":-52,"color":"95,55,184"},{"id":"绍兴九麦网络科技","x":-1042,"y":1249,"color":"102,116,39"},{"id":"浙江彩虹糖网络科技","x":-901,"y":1557,"color":"102,116,39"},{"id":"绍兴鼎烽网络科技","x":-758,"y":1441,"color":"102,116,39"},{"id":"上饶市千星网络科技","x":-864,"y":1212,"color":"102,116,39"},{"id":"霍尔果斯悠星网络科技","x":3371,"y":584,"color":"154,0,119"},{"id":"海南冰魂网络科技","x":3205,"y":514,"color":"154,0,119"},{"id":"上海星枭网络科技","x":3066,"y":596,"color":"154,0,119"},{"id":"上海暗冬网络科技","x":1550,"y":-379,"color":"213,220,227"},{"id":"霍尔果斯心梦流成网络科技","x":2737,"y":-1500,"color":"194,198,1"},{"id":"绍兴萌派网络","x":571,"y":-1083,"color":"79,97,83"},{"id":"上海萝莉网络科技","x":679,"y":-888,"color":"79,97,83"},{"id":"上海墨灿网络科技深圳分公司","x":1786,"y":956,"color":"185,180,159"},{"id":"北京骏游互动网络科技","x":-1865,"y":1046,"color":"47,127,171"},{"id":"上海骏业网络科技","x":-1952,"y":860,"color":"47,127,171"},{"id":"上海骏统网络科技","x":-1704,"y":1058,"color":"47,127,171"},{"id":"新疆骏梦网络科技","x":-1852,"y":707,"color":"47,127,171"},{"id":"骏梦网络科技（平潭）","x":-1682,"y":721,"color":"47,127,171"},{"id":"上海游碧信息科技","x":-1597,"y":904,"color":"47,127,171"},{"id":"上海雷笋网络科技","x":2544,"y":2313,"color":"40,50,75"},{"id":"苏州棋雅网络科技","x":2663,"y":2272,"color":"40,50,75"},{"id":"深圳奎托斯网络科技","x":2769,"y":2036,"color":"40,50,75"},{"id":"凌游网络科技（北京）","x":2582,"y":1896,"color":"40,50,75"},{"id":"北京云际传媒信息技术","x":2433,"y":2272,"color":"40,50,75"},{"id":"上海久刃网络科技","x":2455,"y":1920,"color":"40,50,75"},{"id":"上海游仕网络科技","x":2378,"y":2014,"color":"40,50,75"},{"id":"上海灵禅网络科技股份","x":2377,"y":2154,"color":"40,50,75"},{"id":"北京观颐投资顾问","x":2755,"y":2166,"color":"40,50,75"},{"id":"上海久翼网络科技","x":2699,"y":1938,"color":"40,50,75"},{"id":"上海布布乐育信息科技","x":-668,"y":-1905,"color":"18,74,117"},{"id":"河北焦墨信息技术","x":-1775,"y":-779,"color":"64,58,252"},{"id":"上海哈购网络科技","x":-1642,"y":-664,"color":"64,58,252"},{"id":"上海超米广告","x":-1905,"y":-457,"color":"64,58,252"},{"id":"广州卓游信息科技","x":-1418,"y":1616,"color":"73,8,54"},{"id":"深圳市创梦天地科技","x":575,"y":2650,"color":"113,228,94"},{"id":"福建网龙计算机网络信息技术","x":2870,"y":-716,"color":"185,166,250"},{"id":"广州库洛科技","x":105,"y":-1910,"color":"49,131,83"},{"id":"广州盈正信息技术","x":1260,"y":-2070,"color":"17,84,30"},{"id":"深圳凯撒网络科技","x":389,"y":-1479,"color":"77,177,72"},{"id":"深圳市创世互动科技","x":2035,"y":2776,"color":"184,165,44"},{"id":"深圳欣欣互动科技","x":1408,"y":2964,"color":"49,115,142"},{"id":"广州明朝互动科技股份","x":-1998,"y":245,"color":"48,28,93"},{"id":"广州诗悦网络科技","x":-1147,"y":-1241,"color":"25,199,181"},{"id":"广州银汉科技","x":-1422,"y":-59,"color":"91,201,216"},{"id":"海南盛游信息科技","x":-1371,"y":1429,"color":"73,8,54"},{"id":"上海掌致信息科技","x":-1251,"y":1523,"color":"73,8,54"},{"id":"广州位面信息科技","x":-1455,"y":1810,"color":"73,8,54"},{"id":"深圳战艺网络科技","x":-1311,"y":1781,"color":"73,8,54"},{"id":"广州麟游信息科技","x":-1610,"y":1573,"color":"73,8,54"},{"id":"深圳市奥术信息科技","x":-1224,"y":1671,"color":"73,8,54"},{"id":"广州雷神信息科技","x":-1532,"y":1455,"color":"73,8,54"},{"id":"珠海市汇垠广奥股权投资基金管理","x":-1576,"y":1723,"color":"73,8,54"},{"id":"创梦无限（北京）信息技术","x":792,"y":2482,"color":"113,228,94"},{"id":"深圳市晨海之星科技","x":838,"y":2718,"color":"113,228,94"},{"id":"海南创梦天地科技","x":386,"y":2807,"color":"113,228,94"},{"id":"深圳市创享梦聚科技","x":450,"y":2402,"color":"113,228,94"},{"id":"湖南省崀山创梦天地文化传播","x":360,"y":2502,"color":"113,228,94"},{"id":"霍尔果斯创梦天地信息科技","x":567,"y":2384,"color":"113,228,94"},{"id":"深圳市未完待续科技","x":390,"y":2665,"color":"113,228,94"},{"id":"深圳市前海聚正投资管理","x":309,"y":2603,"color":"113,228,94"},{"id":"深圳市创梦互娱科技","x":847,"y":2601,"color":"113,228,94"},{"id":"深圳市梦作坊科技","x":706,"y":2403,"color":"113,228,94"},{"id":"深圳市创梦天地娱乐","x":445,"y":2894,"color":"113,228,94"},{"id":"广州提子网络科技","x":742,"y":2747,"color":"113,228,94"},{"id":"安徽思创体育发展","x":665,"y":2862,"color":"113,228,94"},{"id":"深圳市前海益启信元投资中心（有限合伙）","x":469,"y":2495,"color":"113,228,94"},{"id":"必盈图广告（上海）","x":770,"y":2848,"color":"113,228,94"},{"id":"北京微播科技发展","x":524,"y":2832,"color":"113,228,94"},{"id":"北京创联时讯信息科技","x":311,"y":2737,"color":"113,228,94"},{"id":"珠海君武投资管理合伙企业（有限合伙）","x":585,"y":2923,"color":"113,228,94"},{"id":"深圳市卓游科技","x":634,"y":2469,"color":"113,228,94"},{"id":"上海盛戏网络科技","x":751,"y":2580,"color":"113,228,94"},{"id":"福州天诺网络科技","x":3020,"y":-482,"color":"185,166,250"},{"id":"福州天景网络科技","x":3055,"y":-576,"color":"185,166,250"},{"id":"福州天人网络信息技术服务","x":2852,"y":-898,"color":"185,166,250"},{"id":"福州畅裕网络科技","x":2603,"y":-815,"color":"185,166,250"},{"id":"福建网龙艺术传播","x":2622,"y":-708,"color":"185,166,250"},{"id":"福建天音文化传媒","x":3136,"y":-634,"color":"185,166,250"},{"id":"福建省天晴互动娱乐","x":2684,"y":-915,"color":"185,166,250"},{"id":"福建省华渔教育科技","x":3055,"y":-863,"color":"185,166,250"},{"id":"福建天渔教育科技","x":2899,"y":-437,"color":"185,166,250"},{"id":"福建天越现代教育发展","x":2918,"y":-537,"color":"185,166,250"},{"id":"福州天时网络科技","x":2798,"y":-476,"color":"185,166,250"},{"id":"海南天趣娱乐","x":2909,"y":-990,"color":"185,166,250"},{"id":"上海天坤数码科技","x":2993,"y":-931,"color":"185,166,250"},{"id":"厦门天盼网络科技","x":2707,"y":-808,"color":"185,166,250"},{"id":"北京网中软件科技","x":2698,"y":-500,"color":"185,166,250"},{"id":"福建省网云虚拟现实技术发展","x":3060,"y":-713,"color":"185,166,250"},{"id":"福建天渺网络科技","x":3128,"y":-785,"color":"185,166,250"},{"id":"福建省国腾信息科技","x":2718,"y":-604,"color":"185,166,250"},{"id":"昆明网龙华渔科技发展","x":2779,"y":-970,"color":"185,166,250"},{"id":"成都掌沃无限科技","x":2614,"y":-604,"color":"185,166,250"},{"id":"广州库洛姆科技","x":272,"y":-1912,"color":"49,131,83"},{"id":"广州市巧智数码科技","x":1278,"y":-1905,"color":"17,84,30"},{"id":"北京天雨网络科技","x":1328,"y":-2230,"color":"17,84,30"},{"id":"伊犁讯娱网络科技","x":252,"y":-1372,"color":"77,177,72"},{"id":"四川天上友嘉网络科技","x":318,"y":-1632,"color":"77,177,72"},{"id":"深圳前海凯撒文化","x":445,"y":-1310,"color":"77,177,72"},{"id":"杭州幻文科技","x":560,"y":-1483,"color":"77,177,72"},{"id":"霍尔果斯万家游戏信息科技","x":1884,"y":2843,"color":"184,165,44"},{"id":"深圳市神话互娱科技","x":1359,"y":2795,"color":"49,115,142"},{"id":"霍尔果斯神话互娱科技","x":1571,"y":2917,"color":"49,115,142"},{"id":"深圳方圆互娱科技","x":1241,"y":3004,"color":"49,115,142"},{"id":"广州梦次元信息科技","x":-1952,"y":410,"color":"48,28,93"},{"id":"上海其趣网络科技","x":-977,"y":-1138,"color":"25,199,181"},{"id":"上海轻量网络科技","x":-1016,"y":-1392,"color":"25,199,181"},{"id":"上海萌彩网络科技","x":-1213,"y":-1051,"color":"25,199,181"},{"id":"珠海诗悦网络科技","x":-1272,"y":-1394,"color":"25,199,181"},{"id":"海南诗悦网络科技","x":-949,"y":-1273,"color":"25,199,181"},{"id":"海南诚悦网络科技","x":-1083,"y":-1046,"color":"25,199,181"},{"id":"海南晴空网络科技","x":-1142,"y":-1444,"color":"25,199,181"},{"id":"海南欢悦网络科技","x":-1346,"y":-1271,"color":"25,199,181"},{"id":"福州星环互动网络","x":-1321,"y":-1137,"color":"25,199,181"},{"id":"银汉互娱（天津）科技","x":-1264,"y":88,"color":"91,201,216"},{"id":"广州泳泳信息科技","x":-1188,"y":21,"color":"91,201,216"},{"id":"霍尔果斯市银汉股权投资","x":-1647,"y":-146,"color":"91,201,216"},{"id":"海南银汉科技","x":-1552,"y":78,"color":"91,201,216"},{"id":"霍尔果斯前见股权投资","x":-1648,"y":-49,"color":"91,201,216"},{"id":"深圳银创互娱科技","x":-1291,"y":-199,"color":"91,201,216"},{"id":"上海廿迷网络科技","x":-1425,"y":163,"color":"91,201,216"},{"id":"广州果橙缤纷网络科技合伙企业（有限合伙）","x":-1502,"y":-280,"color":"91,201,216"},{"id":"广州飞雨网络科技","x":-1298,"y":-297,"color":"91,201,216"},{"id":"广州金楚信息技术","x":-1531,"y":178,"color":"91,201,216"},{"id":"深圳市律动信息科技","x":-1649,"y":57,"color":"91,201,216"},{"id":"广州子苏科技","x":-1575,"y":-215,"color":"91,201,216"},{"id":"上海侠娱网络科技","x":-1186,"y":-178,"color":"91,201,216"},{"id":"广州帝释天软件","x":-1405,"y":-293,"color":"91,201,216"},{"id":"广州市游毅坊网络科技","x":-1214,"y":-76,"color":"91,201,216"},{"id":"北京可为互娱文化科技","x":-1328,"y":166,"color":"91,201,216"},{"id":"北京龙拳风暴科技","x":1236,"y":1044,"color":"161,42,164"},{"id":"乐元素科技（北京）股份","x":1010,"y":1638,"color":"252,16,7"},{"id":"百度移信网络技术（北京）","x":623,"y":-2238,"color":"167,87,102"},{"id":"北京太能沃可网络科技股份","x":1591,"y":-2180,"color":"133,54,57"},{"id":"北京蓝鲸时代科技","x":1742,"y":1411,"color":"196,56,66"},{"id":"蓝港在线（北京）科技","x":1299,"y":323,"color":"162,66,56"},{"id":"北京巴别时代科技股份","x":2121,"y":-1763,"color":"77,89,88"},{"id":"北京灵游坊网络科技","x":392,"y":-269,"color":"254,87,246"},{"id":"中手游移动科技","x":-378,"y":-1429,"color":"5,79,243"},{"id":"北京天马时空网络技术","x":2041,"y":-908,"color":"2,79,221"},{"id":"必果互娱（北京）科技","x":-1205,"y":620,"color":"41,183,209"},{"id":"北京大神圈文化科技","x":-1102,"y":2205,"color":"163,147,34"},{"id":"乐道互动（天津）科技","x":1023,"y":-620,"color":"9,48,148"},{"id":"成都西山居互动娱乐科技","x":2514,"y":1116,"color":"125,166,21"},{"id":"北京微笑科技","x":-58,"y":-1331,"color":"11,193,34"},{"id":"北京水琴铃信息技术","x":1080,"y":-2218,"color":"99,30,177"},{"id":"霍尔果斯龙拳网络科技","x":1335,"y":1188,"color":"161,42,164"},{"id":"苏州工业园区龙拳风暴信息科技","x":1061,"y":1050,"color":"161,42,164"},{"id":"天津龙拳风暴科技","x":1416,"y":1021,"color":"161,42,164"},{"id":"天津乐浣科技发展有限责任公司","x":814,"y":1580,"color":"252,16,7"},{"id":"上海乐擎投资管理","x":1135,"y":1473,"color":"252,16,7"},{"id":"天津乐爱豆科技发展有限责任公司","x":1204,"y":1694,"color":"252,16,7"},{"id":"北京乐元素文化发展","x":1125,"y":1803,"color":"252,16,7"},{"id":"北京创智汇聚科技","x":891,"y":1471,"color":"252,16,7"},{"id":"上海乐梨科技","x":815,"y":1710,"color":"252,16,7"},{"id":"元素创造（深圳）网络科技","x":1211,"y":1569,"color":"252,16,7"},{"id":"北京零壹元素网络科技","x":1004,"y":1846,"color":"252,16,7"},{"id":"北京丹晟投资基金中心（有限合伙）","x":889,"y":1812,"color":"252,16,7"},{"id":"上海绘界文化传播","x":1014,"y":1431,"color":"252,16,7"},{"id":"北京百度移讯科技","x":466,"y":-2323,"color":"167,87,102"},{"id":"北京百度多酷科技","x":483,"y":-2123,"color":"167,87,102"},{"id":"天津多酷紫桐科技","x":702,"y":-2394,"color":"167,87,102"},{"id":"海南多酷信息技术","x":803,"y":-2207,"color":"167,87,102"},{"id":"自然光影（北京）图像科技","x":662,"y":-2067,"color":"167,87,102"},{"id":"霍尔果斯闪电网络科技","x":1712,"y":-2042,"color":"133,54,57"},{"id":"苏州太能沃可网络科技","x":1756,"y":-2226,"color":"133,54,57"},{"id":"宁波梅山保税港区陶朱安达投资管理中心（有限合伙）","x":1535,"y":-2011,"color":"133,54,57"},{"id":"喀什蓝鲸时代网络科技","x":1591,"y":1354,"color":"196,56,66"},{"id":"南京翊瑅网络科技","x":1875,"y":1510,"color":"196,56,66"},{"id":"蓝港星云（北京）科技","x":1455,"y":553,"color":"162,66,56"},{"id":"手游通（北京）科技","x":1218,"y":580,"color":"162,66,56"},{"id":"北京蓝虎鲸科技","x":1111,"y":265,"color":"162,66,56"},{"id":"北京趣味指间网络科技","x":1105,"y":521,"color":"162,66,56"},{"id":"北京智讯天通信息技术","x":1570,"y":335,"color":"162,66,56"},{"id":"多边形（北京）科技","x":1408,"y":170,"color":"162,66,56"},{"id":"北京三栖人科技","x":1296,"y":55,"color":"162,66,56"},{"id":"天津八八六四网络技术","x":1541,"y":469,"color":"162,66,56"},{"id":"北京峰与隆互动文化","x":1513,"y":255,"color":"162,66,56"},{"id":"蓝港影业（天津）","x":1515,"y":150,"color":"162,66,56"},{"id":"多边形（海南）网络科技","x":1407,"y":69,"color":"162,66,56"},{"id":"珠海蓝港在线科技","x":1474,"y":400,"color":"162,66,56"},{"id":"霍尔果斯蓝港影业","x":1324,"y":592,"color":"162,66,56"},{"id":"星满天（海南）影视","x":1241,"y":143,"color":"162,66,56"},{"id":"北京古德时代科技","x":1364,"y":501,"color":"162,66,56"},{"id":"蓝港思必特（北京）科技","x":1082,"y":417,"color":"162,66,56"},{"id":"广州鸿娱网络科技","x":1203,"y":479,"color":"162,66,56"},{"id":"海南天辰网络科技","x":1032,"y":330,"color":"162,66,56"},{"id":"武汉极客猿教育科技","x":1079,"y":174,"color":"162,66,56"},{"id":"北京创享天下网络科技","x":1160,"y":88,"color":"162,66,56"},{"id":"苏州湖图网络科技","x":1963,"y":-1678,"color":"77,89,88"},{"id":"海南巴别时代科技","x":2281,"y":-1858,"color":"77,89,88"},{"id":"上海履冰科技","x":2286,"y":-1687,"color":"77,89,88"},{"id":"北京量子维度科技","x":1971,"y":-1870,"color":"77,89,88"},{"id":"中广娱文传媒","x":2138,"y":-1575,"color":"77,89,88"},{"id":"厦门优莱柏网络科技","x":2124,"y":-1948,"color":"77,89,88"},{"id":"北京灵游坊软件技术","x":337,"y":-437,"color":"254,87,246"},{"id":"海南灵游坊网络科技","x":556,"y":-206,"color":"254,87,246"},{"id":"北京灵动时光科技","x":521,"y":-399,"color":"254,87,246"},{"id":"北京灵徒文化传媒","x":356,"y":-92,"color":"254,87,246"},{"id":"北京酷者网络科技","x":220,"y":-222,"color":"254,87,246"},{"id":"深圳市岚悦网络科技","x":-544,"y":-1390,"color":"5,79,243"},{"id":"霍尔果斯中手游创业投资","x":-414,"y":-1599,"color":"5,79,243"},{"id":"宜春天成网络科技","x":2057,"y":-1093,"color":"2,79,221"},{"id":"北京天际启游科技","x":1923,"y":-773,"color":"2,79,221"},{"id":"上海天銮网络技术","x":2195,"y":-994,"color":"2,79,221"},{"id":"上海扎古网络科技","x":2088,"y":-727,"color":"2,79,221"},{"id":"广州战法牧网络科技","x":1881,"y":-986,"color":"2,79,221"},{"id":"北京必果互动网络技术","x":-1073,"y":724,"color":"41,183,209"},{"id":"广州御和必果网络科技","x":-1377,"y":621,"color":"41,183,209"},{"id":"北京大神圈影视文化","x":-1269,"y":2232,"color":"163,147,34"},{"id":"霍尔果斯大神圈影视传媒","x":-1067,"y":2381,"color":"163,147,34"},{"id":"上海大神圈影视文化","x":-1146,"y":2037,"color":"163,147,34"},{"id":"乐道互动（天津）软件技术","x":993,"y":-430,"color":"9,48,148"},{"id":"乐道互动（广东）科技","x":1159,"y":-484,"color":"9,48,148"},{"id":"乐道互动（上海）软件技术","x":976,"y":-802,"color":"9,48,148"},{"id":"淮安德润网络科技","x":845,"y":-681,"color":"9,48,148"},{"id":"淮安易趣网络科技","x":1217,"y":-631,"color":"9,48,148"},{"id":"乐道互动（北京）科技","x":860,"y":-519,"color":"9,48,148"},{"id":"上海游曳网络科技","x":1147,"y":-770,"color":"9,48,148"},{"id":"大连金山互动娱乐科技","x":2711,"y":1125,"color":"125,166,21"},{"id":"珠海金山网络游戏科技","x":2579,"y":942,"color":"125,166,21"},{"id":"北京西山居互动娱乐科技","x":2326,"y":1182,"color":"125,166,21"},{"id":"广州西山居世游网络科技","x":2344,"y":903,"color":"125,166,21"},{"id":"珠海西山居移动游戏科技","x":2243,"y":1106,"color":"125,166,21"},{"id":"珠海西山居互动娱乐科技","x":2347,"y":1326,"color":"125,166,21"},{"id":"成都浣沙文化传媒","x":2709,"y":974,"color":"125,166,21"},{"id":"武汉西腾科技","x":2775,"y":1051,"color":"125,166,21"},{"id":"成都可萌世界网络科技","x":2636,"y":1262,"color":"125,166,21"},{"id":"珠海剑心互动娱乐","x":2260,"y":1247,"color":"125,166,21"},{"id":"西山居多盈（北京）科技","x":2710,"y":1318,"color":"125,166,21"},{"id":"上海越群网络科技","x":2579,"y":1371,"color":"125,166,21"},{"id":"上海光爪网络科技","x":2662,"y":877,"color":"125,166,21"},{"id":"深圳绿碧时代网络","x":2769,"y":1210,"color":"125,166,21"},{"id":"北京双米互动信息技术","x":2474,"y":1294,"color":"125,166,21"},{"id":"珠海乐趣科技","x":2443,"y":888,"color":"125,166,21"},{"id":"深圳市趣上科技","x":2256,"y":997,"color":"125,166,21"},{"id":"深圳市霜刃科技","x":2534,"y":842,"color":"125,166,21"},{"id":"神游互动科技（深圳）","x":2353,"y":1020,"color":"125,166,21"},{"id":"北京漫考拉文化传媒","x":2448,"y":1383,"color":"125,166,21"},{"id":"厦门趣合怡科技","x":67,"y":-1215,"color":"11,193,34"},{"id":"北京远鸣网络科技","x":1070,"y":-2386,"color":"99,30,177"},{"id":"成都龙渊网络科技","x":-438,"y":2178,"color":"38,169,139"},{"id":"成都五维互娱科技","x":2487,"y":-1549,"color":"42,19,228"},{"id":"北京奇艺世纪科技","x":741,"y":-1755,"color":"172,207,178"},{"id":"成都萤火虫信息技术","x":3256,"y":77,"color":"153,51,76"},{"id":"成都龙渊盛世科技","x":-269,"y":2010,"color":"38,169,139"},{"id":"成都龙渊奇迹网络科技","x":-695,"y":2207,"color":"38,169,139"},{"id":"成都蒙斯克网络科技","x":-637,"y":2289,"color":"38,169,139"},{"id":"上海簇鹰网络科技","x":-247,"y":2153,"color":"38,169,139"},{"id":"成都龙渊传奇网络科技","x":-607,"y":2392,"color":"38,169,139"},{"id":"北京龙五网络科技","x":-496,"y":1918,"color":"38,169,139"},{"id":"成都凯利丹网络科技","x":-662,"y":2037,"color":"38,169,139"},{"id":"绵阳龙渊网络科技","x":-513,"y":2348,"color":"38,169,139"},{"id":"成都词牌社文化传播","x":-423,"y":1990,"color":"38,169,139"},{"id":"成都游理想科技","x":-473,"y":2449,"color":"38,169,139"},{"id":"成都龙腾云卷网络科技","x":-290,"y":2401,"color":"38,169,139"},{"id":"成都蛋卷科技","x":-340,"y":1932,"color":"38,169,139"},{"id":"成都映霸龙渊文化传播","x":-629,"y":2129,"color":"38,169,139"},{"id":"北京亿虎乐游网络科技","x":-185,"y":2077,"color":"38,169,139"},{"id":"北京漫动科技","x":-570,"y":1990,"color":"38,169,139"},{"id":"北京简娱科技","x":-262,"y":2303,"color":"38,169,139"},{"id":"深圳市四楼无限科技","x":-182,"y":2236,"color":"38,169,139"},{"id":"成都任客科技","x":-385,"y":2392,"color":"38,169,139"},{"id":"成都牵手汇科技有限责任公司","x":2387,"y":-1395,"color":"42,19,228"},{"id":"上海爱奇艺互娱科技","x":576,"y":-1758,"color":"172,207,178"},{"id":"北京国址地信息咨询有限责任公司","x":876,"y":-1859,"color":"172,207,178"},{"id":"喀什乐线信息技术","x":3128,"y":-35,"color":"153,51,76"},{"id":"霍尔果斯萤火虫信息技术","x":3092,"y":163,"color":"153,51,76"},{"id":"成都战魂信息技术","x":3298,"y":248,"color":"153,51,76"},{"id":"成都云奇信息技术","x":3431,"y":126,"color":"153,51,76"},{"id":"成都八九七文化传播","x":3375,"y":-60,"color":"153,51,76"}],"links":[{"source":"上海米哈游网络科技股份","target":"哈游文化传媒（上海）","label":"投资"},{"source":"上海米哈游网络科技股份","target":"米哈游科技（上海）","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海吼美科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海米哈游天命科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"霍尔果斯圣芙蕾雅科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海交宅科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海羽渡尘科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海米哈游影铁科技","label":"投资"},{"source":"上海米哈游网络科技股份","target":"上海米哈游重装小兔科技","label":"投资"},{"source":"上海游族信息技术","target":"上海游豪信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海游家信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海游娱信息技术","label":"投资"},{"source":"上海游族信息技术","target":"南京游族信息技术","label":"投资"},{"source":"上海游族信息技术","target":"苏州游族信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海驰游信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海游族互娱网络科技","label":"投资"},{"source":"上海游族信息技术","target":"成都游族信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海游梅信息技术","label":"投资"},{"source":"上海游族信息技术","target":"上海游辰信息技术","label":"投资"},{"source":"上海游族信息技术","target":"重庆游族互娱网络科技","label":"投资"},{"source":"上海游族信息技术","target":"上海完游网络技术","label":"投资"},{"source":"上海游族信息技术","target":"上海猫游网络科技","label":"投资"},{"source":"上海游族信息技术","target":"北京嘉智游时投资中心（有限合伙）","label":"投资"},{"source":"上海游族信息技术","target":"上海鹿扬网络科技","label":"投资"},{"source":"上海游族信息技术","target":"北京厚德众合咨询中心（有限合伙）","label":"投资"},{"source":"苏州齐思妙想信息科技","target":"苏州齐思妙想孵化器管理","label":"投资"},{"source":"苏州齐思妙想信息科技","target":"深圳中科启明股权投资基金合伙企业（有限合伙）","label":"投资"},{"source":"上海数龙科技","target":"天津盛景贸易","label":"投资"},{"source":"上海数龙科技","target":"天津游吉科技","label":"投资"},{"source":"上海数龙科技","target":"宁夏智捷付电子支付服务","label":"投资"},{"source":"上海数龙科技","target":"盐城市盛境网络科技","label":"投资"},{"source":"上海数龙科技","target":"宁夏数龙科技网络","label":"投资"},{"source":"上海数龙科技","target":"上海盛页信息科技","label":"投资"},{"source":"上海数龙科技","target":"喀什盛启信息科技","label":"投资"},{"source":"上海数龙科技","target":"成都游吉科技","label":"投资"},{"source":"上海数龙科技","target":"南京数龙计算机科技","label":"投资"},{"source":"上海数龙科技","target":"上海灵游科技","label":"投资"},{"source":"上海数龙科技","target":"上海宁乐科技","label":"投资"},{"source":"上海数龙科技","target":"郑州聚凡网络技术","label":"投资"},{"source":"上海数龙科技","target":"上海秋千软件科技","label":"投资"},{"source":"上海数龙科技","target":"上海炽宇网络科技","label":"投资"},{"source":"上海数龙科技","target":"上海盛多网络科技","label":"投资"},{"source":"上海数龙科技","target":"北京众诚协作科技开发","label":"投资"},{"source":"上海数龙科技","target":"上海维莱信息科技","label":"投资"},{"source":"上海数龙科技","target":"成都锦天科技发展有限责任公司","label":"投资"},{"source":"上海数龙科技","target":"成都星漫科技","label":"投资"},{"source":"上海数龙科技","target":"成都锦龙科技","label":"投资"},{"source":"芜湖乐时网络科技","target":"海南妙酷网络科技","label":"投资"},{"source":"芜湖乐时网络科技","target":"杭州乐港科技","label":"投资"},{"source":"芜湖乐时网络科技","target":"芜湖蟠龙网络科技","label":"投资"},{"source":"玩心（上海）网络科技","target":"北京冠智信息技术","label":"投资"},{"source":"上海寒诀网络科技","target":"上海乌普斯文化创意","label":"投资"},{"source":"上海寒诀网络科技","target":"上海竹墨网络科技","label":"投资"},{"source":"上海寒诀网络科技","target":"上海寒跃影视文化","label":"投资"},{"source":"上海弘贯网络科技","target":"霍尔果斯弘贯网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州明动网游网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州易博网游网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州暄武网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州玖霄网游网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南暄武网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南创超网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南侠游网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南朱雀网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南明动网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南弘贯网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南爱萌网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南逗爱玩网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南虾投网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南有乾网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南鹿头网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"海南伐彩网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州创超网络科技","label":"投资"},{"source":"上海弘贯网络科技","target":"广州朱雀网络科技","label":"投资"},{"source":"上海鹰狮互娱科技","target":"上海连娱网络科技","label":"投资"},{"source":"骨迪（上海）网络科技","target":"上海至玩领域网络科技","label":"投资"},{"source":"骨迪（上海）网络科技","target":"上海构堂网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"北京星火互娱科技","label":"投资"},{"source":"江苏易乐网络科技","target":"镇江傲游网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"霍尔果斯飓风网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"上海业巧企业管理咨询","label":"投资"},{"source":"江苏易乐网络科技","target":"上海宜儒企业管理咨询","label":"投资"},{"source":"江苏易乐网络科技","target":"广州铭侠网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"镇江嘻游网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"镇江乐韵网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"北京文易电竞文化传媒","label":"投资"},{"source":"江苏易乐网络科技","target":"北京八爪鱼互娱科技","label":"投资"},{"source":"江苏易乐网络科技","target":"广州火凤网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"海南玩的溜网络科技","label":"投资"},{"source":"江苏易乐网络科技","target":"杭州西钺网络科技","label":"投资"},{"source":"上海天赐之恒网络科技","target":"杭州天巽网络科技","label":"投资"},{"source":"上海鹰角网络科技","target":"上海白神企业管理","label":"投资"},{"source":"上海鹰角网络科技","target":"上海木鸢网络科技","label":"投资"},{"source":"上海鹰角网络科技","target":"霍尔果斯鹰角网络科技","label":"投资"},{"source":"上海鹰角网络科技","target":"上海悠星网络科技","label":"投资"},{"source":"上海鹰角网络科技","target":"上海彼方网络科技","label":"投资"},{"source":"上海番糖网络科技","target":"上海番果网络科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海数龙科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海鸿利数码科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"天津盛启信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海盛鹏信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海盛展网络科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"无锡盛趣知识产权运营中心","label":"投资"},{"source":"盛趣信息技术（上海）","target":"宜春盛趣信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上饶县志存投资中心（有限合伙）","label":"投资"},{"source":"盛趣信息技术（上海）","target":"深圳盛众科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海摩凡网络科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海麦石信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"广州奥兹软件科技发展","label":"投资"},{"source":"盛趣信息技术（上海）","target":"深圳市悠游数码科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海时迈信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"北京达意之都文化传播","label":"投资"},{"source":"盛趣信息技术（上海）","target":"北京锋盛时代科技","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海因菲尼迪网络科技发展","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海大秦信息技术","label":"投资"},{"source":"盛趣信息技术（上海）","target":"石家庄海澜网络游戏开发有限责任公司","label":"投资"},{"source":"盛趣信息技术（上海）","target":"上海蓝田信息科技","label":"投资"},{"source":"上海红月网络科技","target":"霍尔果斯绯夜网络科技","label":"投资"},{"source":"上海红月网络科技","target":"上海雷笛网络科技","label":"投资"},{"source":"拾梦文化发展（上海）","target":"拾梦网络科技（海南）","label":"投资"},{"source":"拾梦文化发展（上海）","target":"拾萌文化发展（上海）","label":"投资"},{"source":"上海布鲁潘达网络技术","target":"上海优富广告","label":"投资"},{"source":"杭州浩游科技","target":"嘉兴智敏软件科技","label":"投资"},{"source":"上海慕和网络科技","target":"北京盛娱时代科技","label":"投资"},{"source":"上海慕和网络科技","target":"上海慕明网络科技","label":"投资"},{"source":"上海慕和网络科技","target":"上海行星网络科技","label":"投资"},{"source":"上海慕和网络科技","target":"上海修真网络科技","label":"投资"},{"source":"上海游唐网络技术","target":"上海科奂信息科技","label":"投资"},{"source":"浙江九翎网络科技","target":"绍兴九麦网络科技","label":"投资"},{"source":"浙江九翎网络科技","target":"浙江彩虹糖网络科技","label":"投资"},{"source":"浙江九翎网络科技","target":"绍兴鼎烽网络科技","label":"投资"},{"source":"浙江九翎网络科技","target":"上饶市千星网络科技","label":"投资"},{"source":"上海悠星网络科技","target":"霍尔果斯悠星网络科技","label":"投资"},{"source":"上海悠星网络科技","target":"海南冰魂网络科技","label":"投资"},{"source":"上海悠星网络科技","target":"上海鹰角网络科技","label":"投资"},{"source":"上海悠星网络科技","target":"上海星枭网络科技","label":"投资"},{"source":"上海散爆网络科技","target":"上海暗冬网络科技","label":"投资"},{"source":"杭州心光流美网络科技","target":"霍尔果斯心梦流成网络科技","label":"投资"},{"source":"杭州掌派科技","target":"绍兴萌派网络","label":"投资"},{"source":"杭州掌派科技","target":"上海萝莉网络科技","label":"投资"},{"source":"上海墨灿网络科技","target":"上海墨灿网络科技深圳分公司","label":"投资"},{"source":"上海骏梦网络科技","target":"北京骏游互动网络科技","label":"投资"},{"source":"上海骏梦网络科技","target":"上海骏业网络科技","label":"投资"},{"source":"上海骏梦网络科技","target":"上海骏统网络科技","label":"投资"},{"source":"上海骏梦网络科技","target":"新疆骏梦网络科技","label":"投资"},{"source":"上海骏梦网络科技","target":"骏梦网络科技（平潭）","label":"投资"},{"source":"上海骏梦网络科技","target":"上海游碧信息科技","label":"投资"},{"source":"上海久游网络科技","target":"上海雷笋网络科技","label":"投资"},{"source":"上海久游网络科技","target":"苏州棋雅网络科技","label":"投资"},{"source":"上海久游网络科技","target":"深圳奎托斯网络科技","label":"投资"},{"source":"上海久游网络科技","target":"凌游网络科技（北京）","label":"投资"},{"source":"上海久游网络科技","target":"北京云际传媒信息技术","label":"投资"},{"source":"上海久游网络科技","target":"上海久刃网络科技","label":"投资"},{"source":"上海久游网络科技","target":"上海游仕网络科技","label":"投资"},{"source":"上海久游网络科技","target":"上海灵禅网络科技股份","label":"投资"},{"source":"上海久游网络科技","target":"北京观颐投资顾问","label":"投资"},{"source":"上海久游网络科技","target":"上海久翼网络科技","label":"投资"},{"source":"上海铂漫网络科技","target":"上海布布乐育信息科技","label":"投资"},{"source":"上海焦扬网络科技","target":"河北焦墨信息技术","label":"投资"},{"source":"上海焦扬网络科技","target":"上海哈购网络科技","label":"投资"},{"source":"上海焦扬网络科技","target":"上海超米广告","label":"投资"},{"source":"北京龙拳风暴科技","target":"霍尔果斯龙拳网络科技","label":"投资"},{"source":"北京龙拳风暴科技","target":"苏州工业园区龙拳风暴信息科技","label":"投资"},{"source":"北京龙拳风暴科技","target":"天津龙拳风暴科技","label":"投资"},{"source":"乐元素科技（北京）股份","target":"天津乐浣科技发展有限责任公司","label":"投资"},{"source":"乐元素科技（北京）股份","target":"上海乐擎投资管理","label":"投资"},{"source":"乐元素科技（北京）股份","target":"天津乐爱豆科技发展有限责任公司","label":"投资"},{"source":"乐元素科技（北京）股份","target":"北京乐元素文化发展","label":"投资"},{"source":"乐元素科技（北京）股份","target":"北京创智汇聚科技","label":"投资"},{"source":"乐元素科技（北京）股份","target":"上海乐梨科技","label":"投资"},{"source":"乐元素科技（北京）股份","target":"元素创造（深圳）网络科技","label":"投资"},{"source":"乐元素科技（北京）股份","target":"北京零壹元素网络科技","label":"投资"},{"source":"乐元素科技（北京）股份","target":"北京丹晟投资基金中心（有限合伙）","label":"投资"},{"source":"乐元素科技（北京）股份","target":"上海绘界文化传播","label":"投资"},{"source":"百度移信网络技术（北京）","target":"北京百度移讯科技","label":"投资"},{"source":"百度移信网络技术（北京）","target":"北京百度多酷科技","label":"投资"},{"source":"百度移信网络技术（北京）","target":"天津多酷紫桐科技","label":"投资"},{"source":"百度移信网络技术（北京）","target":"海南多酷信息技术","label":"投资"},{"source":"百度移信网络技术（北京）","target":"自然光影（北京）图像科技","label":"投资"},{"source":"北京太能沃可网络科技股份","target":"霍尔果斯闪电网络科技","label":"投资"},{"source":"北京太能沃可网络科技股份","target":"苏州太能沃可网络科技","label":"投资"},{"source":"北京太能沃可网络科技股份","target":"宁波梅山保税港区陶朱安达投资管理中心（有限合伙）","label":"投资"},{"source":"北京蓝鲸时代科技","target":"喀什蓝鲸时代网络科技","label":"投资"},{"source":"北京蓝鲸时代科技","target":"南京翊瑅网络科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"蓝港星云（北京）科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"手游通（北京）科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京蓝虎鲸科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京趣味指间网络科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京智讯天通信息技术","label":"投资"},{"source":"蓝港在线（北京）科技","target":"多边形（北京）科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京三栖人科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"天津八八六四网络技术","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京峰与隆互动文化","label":"投资"},{"source":"蓝港在线（北京）科技","target":"蓝港影业（天津）","label":"投资"},{"source":"蓝港在线（北京）科技","target":"多边形（海南）网络科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"珠海蓝港在线科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"霍尔果斯蓝港影业","label":"投资"},{"source":"蓝港在线（北京）科技","target":"星满天（海南）影视","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京古德时代科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"蓝港思必特（北京）科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"广州鸿娱网络科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"海南天辰网络科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"武汉极客猿教育科技","label":"投资"},{"source":"蓝港在线（北京）科技","target":"北京创享天下网络科技","label":"投资"},{"source":"北京巴别时代科技股份","target":"苏州湖图网络科技","label":"投资"},{"source":"北京巴别时代科技股份","target":"海南巴别时代科技","label":"投资"},{"source":"北京巴别时代科技股份","target":"上海履冰科技","label":"投资"},{"source":"北京巴别时代科技股份","target":"北京量子维度科技","label":"投资"},{"source":"北京巴别时代科技股份","target":"中广娱文传媒","label":"投资"},{"source":"北京巴别时代科技股份","target":"厦门优莱柏网络科技","label":"投资"},{"source":"北京灵游坊网络科技","target":"北京灵游坊软件技术","label":"投资"},{"source":"北京灵游坊网络科技","target":"海南灵游坊网络科技","label":"投资"},{"source":"北京灵游坊网络科技","target":"北京灵动时光科技","label":"投资"},{"source":"北京灵游坊网络科技","target":"北京灵徒文化传媒","label":"投资"},{"source":"北京灵游坊网络科技","target":"北京酷者网络科技","label":"投资"},{"source":"中手游移动科技","target":"深圳市岚悦网络科技","label":"投资"},{"source":"中手游移动科技","target":"霍尔果斯中手游创业投资","label":"投资"},{"source":"北京天马时空网络技术","target":"宜春天成网络科技","label":"投资"},{"source":"北京天马时空网络技术","target":"北京天际启游科技","label":"投资"},{"source":"北京天马时空网络技术","target":"上海天銮网络技术","label":"投资"},{"source":"北京天马时空网络技术","target":"上海扎古网络科技","label":"投资"},{"source":"北京天马时空网络技术","target":"广州战法牧网络科技","label":"投资"},{"source":"必果互娱（北京）科技","target":"北京必果互动网络技术","label":"投资"},{"source":"必果互娱（北京）科技","target":"广州御和必果网络科技","label":"投资"},{"source":"北京大神圈文化科技","target":"北京大神圈影视文化","label":"投资"},{"source":"北京大神圈文化科技","target":"霍尔果斯大神圈影视传媒","label":"投资"},{"source":"北京大神圈文化科技","target":"上海大神圈影视文化","label":"投资"},{"source":"乐道互动（天津）科技","target":"乐道互动（天津）软件技术","label":"投资"},{"source":"乐道互动（天津）科技","target":"乐道互动（广东）科技","label":"投资"},{"source":"乐道互动（天津）科技","target":"乐道互动（上海）软件技术","label":"投资"},{"source":"乐道互动（天津）科技","target":"淮安德润网络科技","label":"投资"},{"source":"乐道互动（天津）科技","target":"淮安易趣网络科技","label":"投资"},{"source":"乐道互动（天津）科技","target":"乐道互动（北京）科技","label":"投资"},{"source":"乐道互动（天津）科技","target":"上海游曳网络科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"大连金山互动娱乐科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"珠海金山网络游戏科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"北京西山居互动娱乐科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"广州西山居世游网络科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"珠海西山居移动游戏科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"珠海西山居互动娱乐科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"成都浣沙文化传媒","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"武汉西腾科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"成都可萌世界网络科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"珠海剑心互动娱乐","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"西山居多盈（北京）科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"上海越群网络科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"上海光爪网络科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"深圳绿碧时代网络","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"北京双米互动信息技术","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"珠海乐趣科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"深圳市趣上科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"深圳市霜刃科技","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"神游互动科技（深圳）","label":"投资"},{"source":"成都西山居互动娱乐科技","target":"北京漫考拉文化传媒","label":"投资"},{"source":"北京微笑科技","target":"厦门趣合怡科技","label":"投资"},{"source":"北京水琴铃信息技术","target":"北京远鸣网络科技","label":"投资"},{"source":"广州卓游信息科技","target":"海南盛游信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"上海掌致信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"广州位面信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"深圳战艺网络科技","label":"投资"},{"source":"广州卓游信息科技","target":"广州麟游信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"深圳市奥术信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"广州雷神信息科技","label":"投资"},{"source":"广州卓游信息科技","target":"珠海市汇垠广奥股权投资基金管理","label":"投资"},{"source":"深圳市创梦天地科技","target":"创梦无限（北京）信息技术","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市晨海之星科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"海南创梦天地科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市创享梦聚科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"湖南省崀山创梦天地文化传播","label":"投资"},{"source":"深圳市创梦天地科技","target":"霍尔果斯创梦天地信息科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市未完待续科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市前海聚正投资管理","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市创梦互娱科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市梦作坊科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市创梦天地娱乐","label":"投资"},{"source":"深圳市创梦天地科技","target":"广州提子网络科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"安徽思创体育发展","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市前海益启信元投资中心（有限合伙）","label":"投资"},{"source":"深圳市创梦天地科技","target":"必盈图广告（上海）","label":"投资"},{"source":"深圳市创梦天地科技","target":"北京微播科技发展","label":"投资"},{"source":"深圳市创梦天地科技","target":"北京创联时讯信息科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"珠海君武投资管理合伙企业（有限合伙）","label":"投资"},{"source":"深圳市创梦天地科技","target":"深圳市卓游科技","label":"投资"},{"source":"深圳市创梦天地科技","target":"上海盛戏网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福州天诺网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福州天景网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福州天人网络信息技术服务","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福州畅裕网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建网龙艺术传播","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建天音文化传媒","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建省天晴互动娱乐","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建省华渔教育科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建天渔教育科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建天越现代教育发展","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福州天时网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"海南天趣娱乐","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"上海天坤数码科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"厦门天盼网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"北京网中软件科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建省网云虚拟现实技术发展","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建天渺网络科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"福建省国腾信息科技","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"昆明网龙华渔科技发展","label":"投资"},{"source":"福建网龙计算机网络信息技术","target":"成都掌沃无限科技","label":"投资"},{"source":"广州库洛科技","target":"广州库洛姆科技","label":"投资"},{"source":"广州盈正信息技术","target":"广州市巧智数码科技","label":"投资"},{"source":"广州盈正信息技术","target":"北京天雨网络科技","label":"投资"},{"source":"深圳凯撒网络科技","target":"伊犁讯娱网络科技","label":"投资"},{"source":"深圳凯撒网络科技","target":"四川天上友嘉网络科技","label":"投资"},{"source":"深圳凯撒网络科技","target":"深圳前海凯撒文化","label":"投资"},{"source":"深圳凯撒网络科技","target":"杭州幻文科技","label":"投资"},{"source":"深圳市创世互动科技","target":"霍尔果斯万家游戏信息科技","label":"投资"},{"source":"深圳欣欣互动科技","target":"深圳市神话互娱科技","label":"投资"},{"source":"深圳欣欣互动科技","target":"霍尔果斯神话互娱科技","label":"投资"},{"source":"深圳欣欣互动科技","target":"深圳方圆互娱科技","label":"投资"},{"source":"广州明朝互动科技股份","target":"广州梦次元信息科技","label":"投资"},{"source":"广州诗悦网络科技","target":"上海其趣网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"上海轻量网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"上海萌彩网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"珠海诗悦网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"海南诗悦网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"海南诚悦网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"海南晴空网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"海南欢悦网络科技","label":"投资"},{"source":"广州诗悦网络科技","target":"福州星环互动网络","label":"投资"},{"source":"深圳市创世互动科技","target":"霍尔果斯万家游戏信息科技","label":"投资"},{"source":"广州银汉科技","target":"银汉互娱（天津）科技","label":"投资"},{"source":"广州银汉科技","target":"广州泳泳信息科技","label":"投资"},{"source":"广州银汉科技","target":"霍尔果斯市银汉股权投资","label":"投资"},{"source":"广州银汉科技","target":"海南银汉科技","label":"投资"},{"source":"广州银汉科技","target":"霍尔果斯前见股权投资","label":"投资"},{"source":"广州银汉科技","target":"深圳银创互娱科技","label":"投资"},{"source":"广州银汉科技","target":"上海廿迷网络科技","label":"投资"},{"source":"广州银汉科技","target":"广州果橙缤纷网络科技合伙企业（有限合伙）","label":"投资"},{"source":"广州银汉科技","target":"广州飞雨网络科技","label":"投资"},{"source":"广州银汉科技","target":"广州金楚信息技术","label":"投资"},{"source":"广州银汉科技","target":"深圳市律动信息科技","label":"投资"},{"source":"广州银汉科技","target":"广州子苏科技","label":"投资"},{"source":"广州银汉科技","target":"上海侠娱网络科技","label":"投资"},{"source":"广州银汉科技","target":"广州帝释天软件","label":"投资"},{"source":"广州银汉科技","target":"广州市游毅坊网络科技","label":"投资"},{"source":"广州银汉科技","target":"北京可为互娱文化科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都龙渊盛世科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都龙渊奇迹网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都蒙斯克网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"上海簇鹰网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都龙渊传奇网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"北京龙五网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都凯利丹网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"绵阳龙渊网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都词牌社文化传播","label":"投资"},{"source":"成都龙渊网络科技","target":"成都游理想科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都龙腾云卷网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都蛋卷科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都映霸龙渊文化传播","label":"投资"},{"source":"成都龙渊网络科技","target":"北京亿虎乐游网络科技","label":"投资"},{"source":"成都龙渊网络科技","target":"北京漫动科技","label":"投资"},{"source":"成都龙渊网络科技","target":"北京简娱科技","label":"投资"},{"source":"成都龙渊网络科技","target":"深圳市四楼无限科技","label":"投资"},{"source":"成都龙渊网络科技","target":"成都任客科技","label":"投资"},{"source":"成都五维互娱科技","target":"成都牵手汇科技有限责任公司","label":"投资"},{"source":"北京奇艺世纪科技","target":"上海爱奇艺互娱科技","label":"投资"},{"source":"北京奇艺世纪科技","target":"北京国址地信息咨询有限责任公司","label":"投资"},{"source":"成都萤火虫信息技术","target":"喀什乐线信息技术","label":"投资"},{"source":"成都萤火虫信息技术","target":"霍尔果斯萤火虫信息技术","label":"投资"},{"source":"成都萤火虫信息技术","target":"成都战魂信息技术","label":"投资"},{"source":"成都萤火虫信息技术","target":"成都云奇信息技术","label":"投资"},{"source":"成都萤火虫信息技术","target":"成都八九七文化传播","label":"投资"}]},
	data2:{"nodes":[{"id":1,"label":"贾代善","x":-134,"y":-34,"size":66,"scale":"1.8","color":"rgb(85,133,205)"},{"id":2,"label":"贾源","x":-118,"y":493,"size":66,"scale":"1.5","color":"rgb(74,107,80)"},{"id":3,"label":"娄氏","x":-247,"y":677,"size":66,"scale":"1.4","color":"rgb(74,107,80)"},{"id":4,"label":"贾母","x":-399,"y":-865,"size":66,"scale":"2.0","color":"rgb(251,178,177)"},{"id":5,"label":"老姨奶奶","x":-143,"y":-201,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":6,"label":"贾敏","x":380,"y":254,"size":66,"scale":"1.5","color":"rgb(85,133,205)"},{"id":7,"label":"嫣红","x":-838,"y":625,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":8,"label":"贾赦","x":-853,"y":399,"size":66,"scale":"1.9","color":"rgb(54,228,84)"},{"id":9,"label":"翠云","x":-972,"y":693,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":10,"label":"娇红","x":-1018,"y":494,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":11,"label":"贾迎春","x":-1337,"y":827,"size":66,"scale":"1.8","color":"rgb(54,228,84)"},{"id":12,"label":"赵姨娘","x":937,"y":-632,"size":66,"scale":"1.7","color":"rgb(85,133,205)"},{"id":13,"label":"贾政","x":534,"y":-188,"size":66,"scale":"2.0","color":"rgb(85,133,205)"},{"id":14,"label":"周姨娘","x":435,"y":-401,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":15,"label":"贾珠","x":-33,"y":-459,"size":66,"scale":"1.5","color":"rgb(8,138,23)"},{"id":16,"label":"尤二姐","x":-565,"y":549,"size":66,"scale":"1.5","color":"rgb(159,190,65)"},{"id":17,"label":"贾琏","x":-584,"y":-34,"size":66,"scale":"2.2","color":"rgb(159,190,65)"},{"id":18,"label":"秋桐","x":-421,"y":109,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":19,"label":"平儿","x":-418,"y":-107,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":20,"label":"薛宝衩","x":1827,"y":-347,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":21,"label":"贾宝玉","x":1569,"y":38,"size":66,"scale":"3.0","color":"rgb(218,61,213)"},{"id":22,"label":"花袭人","x":1756,"y":456,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":23,"label":"贾桂","x":1614,"y":473,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":24,"label":"贾菌","x":-366,"y":821,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":25,"label":"周秀才","x":-1616,"y":-172,"size":66,"scale":"1.5","color":"rgb(159,190,65)"},{"id":26,"label":"贾巧姐","x":-1175,"y":-126,"size":66,"scale":"1.5","color":"rgb(159,190,65)"},{"id":27,"label":"周财主","x":-1864,"y":-106,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":28,"label":"周妈妈","x":-1855,"y":-286,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":29,"label":"孙亲太太","x":-1882,"y":1083,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":30,"label":"孙绍祖","x":-1675,"y":990,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":31,"label":"刑大舅二姐","x":-1383,"y":473,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":32,"label":"邢夫人","x":-1135,"y":313,"size":66,"scale":"1.8","color":"rgb(54,228,84)"},{"id":33,"label":"邢德全","x":-1319,"y":143,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":34,"label":"张大老爷","x":-1590,"y":340,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":35,"label":"邢忠","x":-491,"y":320,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":36,"label":"张大老爷之女","x":-1851,"y":346,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":37,"label":"刑秞烟","x":175,"y":247,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":38,"label":"李婶","x":-1462,"y":-1185,"size":66,"scale":"1.6","color":"rgb(8,138,23)"},{"id":39,"label":"李守中","x":-1057,"y":-980,"size":66,"scale":"1.4","color":"rgb(8,138,23)"},{"id":40,"label":"李婶之弟","x":-1662,"y":-1316,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":41,"label":"李纹","x":-1517,"y":-1412,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":42,"label":"甄宝玉","x":-1990,"y":-1018,"size":66,"scale":"1.4","color":"rgb(8,138,23)"},{"id":43,"label":"李绮","x":-1761,"y":-1124,"size":66,"scale":"1.4","color":"rgb(8,138,23)"},{"id":44,"label":"甄应嘉","x":-2211,"y":-866,"size":66,"scale":"1.8","color":"rgb(8,138,23)"},{"id":45,"label":"甄宝玉祖母","x":-2382,"y":-979,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":46,"label":"甄夫人","x":-2214,"y":-1077,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":47,"label":"大姑娘","x":-2097,"y":-709,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":48,"label":"二姑娘","x":-2261,"y":-626,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":49,"label":"三姑娘","x":-2397,"y":-763,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":50,"label":"袭人之母","x":-2594,"y":-306,"size":66,"scale":"1.3","color":"rgb(48,209,89)"},{"id":51,"label":"袭人","x":-2751,"y":-227,"size":66,"scale":"1.4","color":"rgb(48,209,89)"},{"id":52,"label":"花自芳","x":-2873,"y":-113,"size":66,"scale":"1.3","color":"rgb(48,209,89)"},{"id":53,"label":"周琼之子","x":663,"y":238,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":54,"label":"贾探春","x":727,"y":384,"size":66,"scale":"1.8","color":"rgb(194,83,58)"},{"id":55,"label":"林如海之父","x":989,"y":1024,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":56,"label":"林如海","x":815,"y":820,"size":66,"scale":"1.7","color":"rgb(194,83,58)"},{"id":57,"label":"林如海之祖","x":855,"y":1088,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":58,"label":"林如海之子","x":684,"y":1000,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":59,"label":"李妈","x":-1423,"y":-177,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":60,"label":"昭儿","x":-530,"y":-262,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":61,"label":"兴儿","x":-628,"y":179,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":62,"label":"隆儿","x":-877,"y":-207,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":63,"label":"庆儿","x":-798,"y":129,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":64,"label":"赵嬷嬷","x":455,"y":2,"size":66,"scale":"1.6","color":"rgb(159,190,65)"},{"id":65,"label":"赵天梁","x":246,"y":-90,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":66,"label":"赵天栋","x":249,"y":68,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":67,"label":"王信","x":-781,"y":-84,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":68,"label":"王信媳妇","x":-709,"y":-273,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":69,"label":"鲍二","x":-915,"y":-1,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":70,"label":"善姐","x":-669,"y":782,"size":66,"scale":"1.3","color":"rgb(159,190,65)"},{"id":71,"label":"迎春乳母","x":-1704,"y":787,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":72,"label":"王住儿媳妇","x":-1943,"y":764,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":73,"label":"绣桔","x":-1501,"y":980,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":74,"label":"莲花儿","x":-1302,"y":1075,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":75,"label":"秦思祺","x":-1498,"y":1165,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":76,"label":"潘又安","x":-1616,"y":1363,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":77,"label":"贾琮奶妈","x":-1435,"y":682,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":78,"label":"贾琮","x":-1168,"y":600,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":79,"label":"篆儿","x":842,"y":140,"size":66,"scale":"1.4","color":"rgb(54,228,84)"},{"id":80,"label":"新进来的奶子","x":82,"y":-799,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":81,"label":"贾兰","x":21,"y":-633,"size":66,"scale":"1.4","color":"rgb(8,138,23)"},{"id":82,"label":"素云","x":-831,"y":-614,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":83,"label":"李纨","x":-622,"y":-688,"size":66,"scale":"1.6","color":"rgb(8,138,23)"},{"id":84,"label":"碧月","x":-854,"y":-812,"size":66,"scale":"1.3","color":"rgb(8,138,23)"},{"id":85,"label":"抱琴","x":99,"y":708,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":86,"label":"贾元春","x":111,"y":497,"size":66,"scale":"1.5","color":"rgb(33,73,158)"},{"id":87,"label":"李嬷嬷","x":2079,"y":336,"size":66,"scale":"1.4","color":"rgb(218,61,213)"},{"id":88,"label":"张嬷嬷","x":2023,"y":130,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":89,"label":"宋嬷嬷","x":1621,"y":-149,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":90,"label":"叶茗烟","x":2111,"y":-191,"size":66,"scale":"1.4","color":"rgb(218,61,213)"},{"id":91,"label":"锄药","x":1189,"y":-35,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":92,"label":"扫红","x":1326,"y":-296,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":93,"label":"墨雨","x":1670,"y":-305,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":94,"label":"引泉","x":2036,"y":-15,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":95,"label":"扫花","x":1944,"y":-113,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":96,"label":"挑云","x":1778,"y":-31,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":97,"label":"伴鹤","x":1347,"y":384,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":98,"label":"双瑞","x":1238,"y":-177,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":99,"label":"双寿","x":1507,"y":-279,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":100,"label":"老叶妈","x":2429,"y":-326,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":101,"label":"李贵","x":2387,"y":536,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":102,"label":"李嬷嬷孙子","x":1755,"y":168,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":103,"label":"王荣","x":1386,"y":208,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":104,"label":"张若锦","x":1244,"y":276,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":105,"label":"赵亦华","x":1402,"y":-143,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":106,"label":"周瑞","x":789,"y":-1491,"size":66,"scale":"1.7","color":"rgb(122,175,121)"},{"id":107,"label":"王夫人","x":381,"y":-1156,"size":66,"scale":"2.0","color":"rgb(122,175,121)"},{"id":108,"label":"周瑞女儿","x":787,"y":-1729,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":109,"label":"冷子兴","x":966,"y":-1706,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":110,"label":"周嫂子的儿子","x":1091,"y":-1638,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":111,"label":"何三","x":1034,"y":-1477,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":112,"label":"白金钏","x":152,"y":-1362,"size":66,"scale":"1.4","color":"rgb(122,175,121)"},{"id":113,"label":"白玉钏","x":278,"y":-1424,"size":66,"scale":"1.4","color":"rgb(122,175,121)"},{"id":114,"label":"彩云","x":168,"y":-1177,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":115,"label":"彩鸾","x":488,"y":-1349,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":116,"label":"绣鸾","x":581,"y":-1177,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":117,"label":"绣凤","x":319,"y":-1002,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":118,"label":"白老媳妇","x":100,"y":-1556,"size":66,"scale":"1.4","color":"rgb(122,175,121)"},{"id":119,"label":"彩霞之母","x":440,"y":-1913,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":120,"label":"彩霞","x":471,"y":-1612,"size":66,"scale":"1.5","color":"rgb(122,175,121)"},{"id":121,"label":"小霞","x":577,"y":-1882,"size":66,"scale":"1.3","color":"rgb(122,175,121)"},{"id":122,"label":"小鹊","x":1167,"y":-761,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":123,"label":"小吉祥","x":1042,"y":-887,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":124,"label":"赵国基","x":1209,"y":-895,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":125,"label":"钱槐","x":852,"y":-489,"size":66,"scale":"1.4","color":"rgb(85,133,205)"},{"id":126,"label":"贾环","x":708,"y":-338,"size":66,"scale":"1.4","color":"rgb(85,133,205)"},{"id":127,"label":"雪雁","x":1229,"y":1338,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":128,"label":"林黛玉","x":1278,"y":1068,"size":66,"scale":"1.8","color":"rgb(194,83,58)"},{"id":129,"label":"王嬷嬷","x":1422,"y":640,"size":66,"scale":"1.4","color":"rgb(194,83,58)"},{"id":130,"label":"紫鹊","x":1486,"y":1317,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":131,"label":"春纤","x":1368,"y":1392,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":132,"label":"藕官","x":1587,"y":1191,"size":66,"scale":"1.5","color":"rgb(194,83,58)"},{"id":133,"label":"赖嬷嬷","x":2016,"y":1701,"size":66,"scale":"1.3","color":"rgb(201,106,132)"},{"id":134,"label":"赖大","x":2103,"y":1842,"size":66,"scale":"1.5","color":"rgb(201,106,132)"},{"id":135,"label":"赖尚荣","x":2258,"y":1759,"size":66,"scale":"1.3","color":"rgb(201,106,132)"},{"id":136,"label":"赖大的女儿","x":2030,"y":2002,"size":66,"scale":"1.3","color":"rgb(201,106,132)"},{"id":137,"label":"来旺儿","x":-1393,"y":-550,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":138,"label":"王熙凤","x":-1096,"y":-646,"size":66,"scale":"1.9","color":"rgb(185,7,64)"},{"id":139,"label":"旺儿媳妇","x":-1373,"y":-842,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":140,"label":"来喜家的","x":-1232,"y":-889,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":141,"label":"丰儿","x":-1304,"y":-702,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":142,"label":"彩明","x":-1252,"y":-486,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":143,"label":"林红玉","x":-1505,"y":-685,"size":66,"scale":"1.4","color":"rgb(185,7,64)"},{"id":144,"label":"林之孝","x":-1760,"y":-692,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":145,"label":"王善保","x":-1469,"y":183,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":146,"label":"费婆子","x":-1407,"y":332,"size":66,"scale":"1.3","color":"rgb(54,228,84)"},{"id":147,"label":"金鸳鸯","x":-221,"y":-1041,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":148,"label":"琥珀","x":-458,"y":-1068,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":149,"label":"鹦鹉","x":-373,"y":-659,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":150,"label":"珍珠","x":-595,"y":-866,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":151,"label":"翡翠","x":-641,"y":-1010,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":152,"label":"玻璃","x":-333,"y":-1159,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":153,"label":"文官","x":-206,"y":-853,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":154,"label":"傻大姐的娘","x":-761,"y":-1460,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":155,"label":"傻大姐","x":-597,"y":-1212,"size":66,"scale":"1.4","color":"rgb(251,178,177)"},{"id":156,"label":"金彩","x":-2438,"y":1489,"size":66,"scale":"1.3","color":"rgb(16,102,60)"},{"id":157,"label":"鸳鸯","x":-2502,"y":1338,"size":66,"scale":"1.4","color":"rgb(16,102,60)"},{"id":158,"label":"金文翔","x":-2592,"y":1206,"size":66,"scale":"1.3","color":"rgb(16,102,60)"},{"id":159,"label":"多官","x":2645,"y":58,"size":66,"scale":"1.4","color":"rgb(110,181,127)"},{"id":160,"label":"晴雯","x":2262,"y":139,"size":66,"scale":"1.6","color":"rgb(110,181,127)"},{"id":161,"label":"多浑虫父亲","x":2573,"y":191,"size":66,"scale":"1.3","color":"rgb(110,181,127)"},{"id":162,"label":"多姑娘儿","x":2868,"y":81,"size":66,"scale":"1.3","color":"rgb(110,181,127)"},{"id":163,"label":"吴贵","x":2563,"y":343,"size":66,"scale":"1.3","color":"rgb(110,181,127)"},{"id":164,"label":"花芳官","x":1967,"y":479,"size":66,"scale":"1.4","color":"rgb(218,61,213)"},{"id":165,"label":"媚人","x":1342,"y":24,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":166,"label":"麝月","x":1569,"y":-442,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":167,"label":"茜雪","x":1803,"y":-195,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":168,"label":"秋纹","x":1898,"y":62,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":169,"label":"绮霞","x":1850,"y":343,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":170,"label":"碧痕","x":1540,"y":276,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":171,"label":"檀云","x":1203,"y":126,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":172,"label":"四儿","x":1434,"y":-400,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":173,"label":"佳蕙","x":1706,"y":-434,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":174,"label":"坠儿","x":1941,"y":-256,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":175,"label":"紫绡","x":1923,"y":231,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":176,"label":"良儿","x":1690,"y":319,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":177,"label":"何春燕","x":1754,"y":702,"size":66,"scale":"1.6","color":"rgb(194,83,58)"},{"id":178,"label":"厨房中的柳家媳妇","x":1975,"y":-863,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":179,"label":"柳五儿","x":1945,"y":-532,"size":66,"scale":"1.6","color":"rgb(218,61,213)"},{"id":180,"label":"柳二媳妇的妹子","x":2132,"y":-809,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":181,"label":"哥嫂侄儿","x":2245,"y":-683,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":182,"label":"侍书","x":632,"y":659,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":183,"label":"翠墨","x":499,"y":582,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":184,"label":"艾官","x":818,"y":597,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":185,"label":"小蝉","x":1090,"y":721,"size":66,"scale":"1.4","color":"rgb(194,83,58)"},{"id":186,"label":"何婆","x":2055,"y":993,"size":66,"scale":"1.4","color":"rgb(194,83,58)"},{"id":187,"label":"芳官","x":2223,"y":1176,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":188,"label":"小鸠儿","x":1889,"y":994,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":189,"label":"夏婆子","x":1476,"y":922,"size":66,"scale":"1.5","color":"rgb(194,83,58)"},{"id":190,"label":"蒋玉菡","x":1481,"y":428,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":191,"label":"通判傅试","x":319,"y":-292,"size":66,"scale":"1.3","color":"rgb(85,133,205)"},{"id":192,"label":"傅秋芳","x":-206,"y":-2875,"size":66,"scale":"1.3","color":"rgb(17,147,193)"},{"id":193,"label":"傅试","x":-88,"y":-2787,"size":66,"scale":"1.3","color":"rgb(17,147,193)"},{"id":194,"label":"太祖皇帝","x":-1007,"y":2005,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":195,"label":"先皇","x":-836,"y":1883,"size":66,"scale":"1.4","color":"rgb(33,73,158)"},{"id":196,"label":"太上皇","x":-631,"y":1618,"size":66,"scale":"1.6","color":"rgb(33,73,158)"},{"id":197,"label":"皇太后","x":-631,"y":1891,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":198,"label":"太妃","x":-864,"y":1724,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":199,"label":"皇帝","x":-350,"y":1183,"size":66,"scale":"1.8","color":"rgb(33,73,158)"},{"id":200,"label":"吴贵妃","x":-660,"y":1371,"size":66,"scale":"1.4","color":"rgb(33,73,158)"},{"id":201,"label":"周贵人","x":-399,"y":1569,"size":66,"scale":"1.4","color":"rgb(33,73,158)"},{"id":202,"label":"周贵人父亲","x":-398,"y":1867,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":203,"label":"吴天佑","x":-892,"y":1492,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":204,"label":"戴权","x":-419,"y":1373,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":205,"label":"夏守忠","x":-579,"y":1212,"size":66,"scale":"1.3","color":"rgb(33,73,158)"},{"id":206,"label":"贾代化","x":170,"y":1403,"size":66,"scale":"1.5","color":"rgb(74,107,80)"},{"id":207,"label":"贾演","x":20,"y":973,"size":66,"scale":"1.6","color":"rgb(74,107,80)"},{"id":208,"label":"焦大","x":-104,"y":1105,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":209,"label":"贾敷","x":194,"y":1701,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":210,"label":"贾敬","x":358,"y":1615,"size":66,"scale":"1.5","color":"rgb(74,107,80)"},{"id":211,"label":"贾惜春","x":263,"y":1988,"size":66,"scale":"1.6","color":"rgb(74,107,80)"},{"id":212,"label":"史湘云爷爷","x":-681,"y":-1910,"size":66,"scale":"1.6","color":"rgb(251,178,177)"},{"id":213,"label":"史侯","x":-535,"y":-1415,"size":66,"scale":"1.4","color":"rgb(251,178,177)"},{"id":214,"label":"史鼐","x":-815,"y":-2020,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":215,"label":"史鼎","x":-876,"y":-2155,"size":66,"scale":"1.4","color":"rgb(251,178,177)"},{"id":216,"label":"湘云母","x":-645,"y":-2250,"size":66,"scale":"1.4","color":"rgb(251,178,177)"},{"id":217,"label":"史鼎的夫人","x":-1024,"y":-2305,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":218,"label":"史湘云","x":-644,"y":-2545,"size":66,"scale":"1.7","color":"rgb(251,178,177)"},{"id":219,"label":"卫若兰","x":-846,"y":-2579,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":220,"label":"翠缕","x":-739,"y":-2738,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":221,"label":"葵官","x":-539,"y":-2735,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":222,"label":"周奶妈","x":-447,"y":-2558,"size":66,"scale":"1.3","color":"rgb(251,178,177)"},{"id":223,"label":"凤姐之祖王夫人之父","x":-209,"y":-1533,"size":66,"scale":"1.8","color":"rgb(185,7,64)"},{"id":224,"label":"王公","x":-179,"y":-1776,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":225,"label":"王夫人之大兄凤姐之父","x":-788,"y":-1221,"size":66,"scale":"1.6","color":"rgb(185,7,64)"},{"id":226,"label":"王子腾","x":-192,"y":-1985,"size":66,"scale":"1.5","color":"rgb(185,7,64)"},{"id":227,"label":"王子胜","x":-343,"y":-1746,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":228,"label":"薛姨妈","x":283,"y":-1658,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":229,"label":"王成父","x":-584,"y":-1723,"size":66,"scale":"1.4","color":"rgb(185,7,64)"},{"id":230,"label":"老舅太太","x":-1077,"y":-1323,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":231,"label":"王仁","x":-995,"y":-1455,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":232,"label":"王子腾夫人","x":-284,"y":-2198,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":233,"label":"王子腾之女","x":-90,"y":-2263,"size":66,"scale":"1.4","color":"rgb(185,7,64)"},{"id":234,"label":"保宁侯之子","x":-15,"y":-2452,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":235,"label":"王成","x":-954,"y":-1827,"size":66,"scale":"1.4","color":"rgb(185,7,64)"},{"id":236,"label":"王狗儿","x":-1252,"y":-1919,"size":66,"scale":"1.6","color":"rgb(185,7,64)"},{"id":237,"label":"刘氏","x":-1486,"y":-1958,"size":66,"scale":"1.4","color":"rgb(185,7,64)"},{"id":238,"label":"王青儿","x":-1386,"y":-1779,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":239,"label":"王板儿","x":-1308,"y":-2115,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":240,"label":"刘姥姥","x":-1665,"y":-1929,"size":66,"scale":"1.3","color":"rgb(185,7,64)"},{"id":241,"label":"宝钗祖父","x":1254,"y":-1458,"size":66,"scale":"1.5","color":"rgb(191,32,229)"},{"id":242,"label":"薛公","x":1473,"y":-1425,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":243,"label":"薛公之孙","x":767,"y":-1336,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":244,"label":"薛宝琴父","x":1592,"y":-1628,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":245,"label":"薛宝钗","x":665,"y":-539,"size":66,"scale":"1.7","color":"rgb(191,32,229)"},{"id":246,"label":"薛蟠","x":903,"y":-1882,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":247,"label":"同喜","x":142,"y":-1909,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":248,"label":"同贵","x":265,"y":-1994,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":249,"label":"莺儿","x":488,"y":-698,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":250,"label":"文杏","x":659,"y":-791,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":251,"label":"喜儿","x":570,"y":348,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":252,"label":"蕊官","x":851,"y":-898,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":253,"label":"夏金桂","x":796,"y":-2266,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":254,"label":"老苍头","x":975,"y":-2111,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":255,"label":"宝蟾","x":913,"y":-2449,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":256,"label":"小舍儿","x":597,"y":-2350,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":257,"label":"夏奶奶","x":704,"y":-2509,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":258,"label":"夏三","x":561,"y":-2625,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":259,"label":"臻儿","x":1310,"y":-2195,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":260,"label":"香菱","x":1160,"y":-2056,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":261,"label":"薛宝琴母","x":1781,"y":-1670,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":262,"label":"薛蝌","x":1791,"y":-1477,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":263,"label":"薛宝琴","x":1731,"y":-1892,"size":66,"scale":"1.6","color":"rgb(191,32,229)"},{"id":264,"label":"邢岫烟","x":1954,"y":-1393,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":265,"label":"梅翰林之子","x":1811,"y":-2102,"size":66,"scale":"1.4","color":"rgb(191,32,229)"},{"id":266,"label":"小螺","x":1601,"y":-2028,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":267,"label":"荳官","x":1939,"y":-1906,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":268,"label":"梅翰林","x":1801,"y":-2276,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":269,"label":"贾瑞之父","x":-2480,"y":865,"size":66,"scale":"1.5","color":"rgb(212,104,45)"},{"id":270,"label":"贾代儒","x":-2651,"y":908,"size":66,"scale":"1.3","color":"rgb(212,104,45)"},{"id":271,"label":"贾瑞之母","x":-2451,"y":699,"size":66,"scale":"1.3","color":"rgb(212,104,45)"},{"id":272,"label":"贾瑞","x":-2319,"y":931,"size":66,"scale":"1.3","color":"rgb(212,104,45)"},{"id":273,"label":"贾琼","x":1121,"y":-2678,"size":66,"scale":"1.3","color":"rgb(72,98,79)"},{"id":274,"label":"贾琼之母","x":1271,"y":-2584,"size":66,"scale":"1.4","color":"rgb(72,98,79)"},{"id":275,"label":"贾四姐","x":1425,"y":-2502,"size":66,"scale":"1.3","color":"rgb(72,98,79)"},{"id":276,"label":"贾王扁","x":-2787,"y":611,"size":66,"scale":"1.3","color":"rgb(215,162,124)"},{"id":277,"label":"贾王扁之母","x":-2808,"y":450,"size":66,"scale":"1.4","color":"rgb(215,162,124)"},{"id":278,"label":"贾喜鸾","x":-2857,"y":290,"size":66,"scale":"1.3","color":"rgb(215,162,124)"},{"id":279,"label":"贾芸","x":-1193,"y":2427,"size":66,"scale":"1.5","color":"rgb(84,241,109)"},{"id":280,"label":"五嫂子卜氏","x":-980,"y":2456,"size":66,"scale":"1.4","color":"rgb(84,241,109)"},{"id":281,"label":"卜世仁","x":-746,"y":2483,"size":66,"scale":"1.7","color":"rgb(84,241,109)"},{"id":282,"label":"小丫头子","x":-1223,"y":2603,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":283,"label":"倪儿娘子","x":-1524,"y":2420,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":284,"label":"倪二","x":-1380,"y":2297,"size":66,"scale":"1.6","color":"rgb(84,241,109)"},{"id":285,"label":"倪二女儿","x":-1541,"y":2191,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":286,"label":"马贩子王短腿","x":-1321,"y":2120,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":287,"label":"卜世仁娘子","x":-546,"y":2382,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":288,"label":"卜银姐","x":-765,"y":2305,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":289,"label":"王奶奶","x":-579,"y":2578,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":290,"label":"卜世仁店里伙计","x":-820,"y":2670,"size":66,"scale":"1.3","color":"rgb(84,241,109)"},{"id":291,"label":"贾芹","x":-2492,"y":-1349,"size":66,"scale":"1.3","color":"rgb(32,136,67)"},{"id":292,"label":"周氏","x":-2454,"y":-1494,"size":66,"scale":"1.3","color":"rgb(32,136,67)"},{"id":293,"label":"金氏","x":1503,"y":1952,"size":66,"scale":"1.4","color":"rgb(213,166,146)"},{"id":294,"label":"贾璜","x":1693,"y":2015,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":295,"label":"胡氏","x":1251,"y":1812,"size":66,"scale":"1.5","color":"rgb(213,166,146)"},{"id":296,"label":"金荣","x":1458,"y":1783,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":297,"label":"娇杏","x":-2552,"y":21,"size":66,"scale":"1.3","color":"rgb(107,142,172)"},{"id":298,"label":"贾化","x":-2381,"y":103,"size":66,"scale":"1.7","color":"rgb(107,142,172)"},{"id":299,"label":"贾雨村子","x":-2337,"y":-110,"size":66,"scale":"1.3","color":"rgb(107,142,172)"},{"id":300,"label":"应天府门子","x":-2301,"y":309,"size":66,"scale":"1.4","color":"rgb(107,142,172)"},{"id":301,"label":"张如圭","x":-2201,"y":55,"size":66,"scale":"1.3","color":"rgb(107,142,172)"},{"id":302,"label":"王老爷","x":-2526,"y":238,"size":66,"scale":"1.3","color":"rgb(107,142,172)"},{"id":303,"label":"天子之妻","x":-2253,"y":477,"size":66,"scale":"1.3","color":"rgb(107,142,172)"},{"id":304,"label":"东安郡王穆莳拜","x":-2827,"y":-552,"size":66,"scale":"1.3","color":"rgb(249,49,150)"},{"id":305,"label":"东平郡王","x":-2674,"y":-573,"size":66,"scale":"1.3","color":"rgb(249,49,150)"},{"id":306,"label":"南安王太妃","x":183,"y":-2759,"size":66,"scale":"1.3","color":"rgb(154,131,162)"},{"id":307,"label":"南安郡王","x":324,"y":-2828,"size":66,"scale":"1.4","color":"rgb(154,131,162)"},{"id":308,"label":"南安郡王之孙","x":486,"y":-2868,"size":66,"scale":"1.3","color":"rgb(154,131,162)"},{"id":309,"label":"西宁郡王之孙","x":-1818,"y":1746,"size":66,"scale":"1.3","color":"rgb(146,159,41)"},{"id":310,"label":"西宁郡王","x":-1666,"y":1786,"size":66,"scale":"1.4","color":"rgb(146,159,41)"},{"id":311,"label":"西宁郡王妃","x":-1514,"y":1826,"size":66,"scale":"1.3","color":"rgb(146,159,41)"},{"id":312,"label":"北静王太妃","x":2249,"y":-1386,"size":66,"scale":"1.3","color":"rgb(240,130,33)"},{"id":313,"label":"北静郡王","x":2345,"y":-1252,"size":66,"scale":"1.4","color":"rgb(240,130,33)"},{"id":314,"label":"北静王少妃","x":2590,"y":-1330,"size":66,"scale":"1.3","color":"rgb(240,130,33)"},{"id":315,"label":"水溶","x":2512,"y":-1177,"size":66,"scale":"1.5","color":"rgb(240,130,33)"},{"id":316,"label":"北静郡王长府官","x":2610,"y":-1031,"size":66,"scale":"1.3","color":"rgb(240,130,33)"},{"id":317,"label":"镇国公诰命","x":-2101,"y":-1448,"size":66,"scale":"1.3","color":"rgb(24,84,79)"},{"id":318,"label":"牛清","x":-2077,"y":-1617,"size":66,"scale":"1.5","color":"rgb(24,84,79)"},{"id":319,"label":"镇国公诰命长男","x":-2224,"y":-1713,"size":66,"scale":"1.3","color":"rgb(24,84,79)"},{"id":320,"label":"牛继宗","x":-1910,"y":-1663,"size":66,"scale":"1.3","color":"rgb(24,84,79)"},{"id":321,"label":"柳芳","x":2514,"y":1371,"size":66,"scale":"1.3","color":"rgb(199,131,165)"},{"id":322,"label":"柳彪","x":2407,"y":1482,"size":66,"scale":"1.3","color":"rgb(199,131,165)"},{"id":323,"label":"陈瑞文","x":-1857,"y":2184,"size":66,"scale":"1.3","color":"rgb(189,174,168)"},{"id":324,"label":"陈翼","x":-1941,"y":2061,"size":66,"scale":"1.3","color":"rgb(189,174,168)"},{"id":325,"label":"马尚","x":-1602,"y":-2363,"size":66,"scale":"1.3","color":"rgb(3,67,30)"},{"id":326,"label":"马魁","x":-1733,"y":-2283,"size":66,"scale":"1.3","color":"rgb(3,67,30)"},{"id":327,"label":"侯孝康","x":2237,"y":-1812,"size":66,"scale":"1.3","color":"rgb(152,30,162)"},{"id":328,"label":"侯明","x":2317,"y":-1681,"size":66,"scale":"1.3","color":"rgb(152,30,162)"},{"id":329,"label":"缮国公诰命","x":-2002,"y":1515,"size":66,"scale":"1.3","color":"rgb(206,26,110)"},{"id":330,"label":"缮国公","x":-2101,"y":1389,"size":66,"scale":"1.4","color":"rgb(206,26,110)"},{"id":331,"label":"石光珠","x":-2178,"y":1243,"size":66,"scale":"1.3","color":"rgb(206,26,110)"},{"id":332,"label":"蒋子宁","x":-1334,"y":-2522,"size":66,"scale":"1.3","color":"rgb(226,111,7)"},{"id":333,"label":"平原侯","x":-1213,"y":-2617,"size":66,"scale":"1.3","color":"rgb(226,111,7)"},{"id":334,"label":"谢鲸","x":2747,"y":905,"size":66,"scale":"1.3","color":"rgb(80,37,39)"},{"id":335,"label":"定城侯","x":2675,"y":1049,"size":66,"scale":"1.3","color":"rgb(80,37,39)"},{"id":336,"label":"戚建辉","x":-363,"y":2869,"size":66,"scale":"1.3","color":"rgb(134,235,214)"},{"id":337,"label":"襄阳侯","x":-517,"y":2857,"size":66,"scale":"1.3","color":"rgb(134,235,214)"},{"id":338,"label":"裘良","x":-2690,"y":-1062,"size":66,"scale":"1.3","color":"rgb(181,110,193)"},{"id":339,"label":"景田侯","x":-2736,"y":-910,"size":66,"scale":"1.3","color":"rgb(181,110,193)"},{"id":340,"label":"锦乡侯诰命","x":2766,"y":-738,"size":66,"scale":"1.3","color":"rgb(192,73,202)"},{"id":341,"label":"锦乡侯","x":2821,"y":-577,"size":66,"scale":"1.4","color":"rgb(192,73,202)"},{"id":342,"label":"韩奇","x":2875,"y":-411,"size":66,"scale":"1.3","color":"rgb(192,73,202)"},{"id":343,"label":"冯紫英","x":-2255,"y":1754,"size":66,"scale":"1.3","color":"rgb(136,168,67)"},{"id":344,"label":"神武将军冯唐","x":-2146,"y":1858,"size":66,"scale":"1.3","color":"rgb(136,168,67)"},{"id":345,"label":"锦田侯诰命","x":-2084,"y":-1988,"size":66,"scale":"1.3","color":"rgb(87,158,203)"},{"id":346,"label":"马道婆","x":-1950,"y":-2054,"size":66,"scale":"1.3","color":"rgb(87,158,203)"},{"id":347,"label":"地藏庵的圆心","x":1052,"y":-1121,"size":66,"scale":"1.3","color":"rgb(191,32,229)"},{"id":348,"label":"圆心","x":1782,"y":1399,"size":66,"scale":"1.3","color":"rgb(194,83,58)"},{"id":349,"label":"智能儿","x":779,"y":2545,"size":66,"scale":"1.5","color":"rgb(167,216,76)"},{"id":350,"label":"净虚","x":581,"y":2643,"size":66,"scale":"1.9","color":"rgb(167,216,76)"},{"id":351,"label":"智善","x":439,"y":2495,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":352,"label":"智通","x":626,"y":2423,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":353,"label":"于老爷","x":515,"y":2853,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":354,"label":"胡老爷","x":842,"y":2705,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":355,"label":"胡老爷太太","x":708,"y":2816,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":356,"label":"胡老爷公子","x":373,"y":2774,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":357,"label":"张大财主","x":273,"y":2624,"size":66,"scale":"1.4","color":"rgb(167,216,76)"},{"id":358,"label":"智能","x":2233,"y":728,"size":66,"scale":"1.3","color":"rgb(218,61,213)"},{"id":359,"label":"张金哥","x":57,"y":2610,"size":66,"scale":"1.4","color":"rgb(167,216,76)"},{"id":360,"label":"李公子","x":-121,"y":2565,"size":66,"scale":"1.4","color":"rgb(167,216,76)"},{"id":361,"label":"长安原任守备","x":-176,"y":2715,"size":66,"scale":"1.3","color":"rgb(167,216,76)"},{"id":362,"label":"李衙内","x":1715,"y":2330,"size":66,"scale":"1.3","color":"rgb(7,185,33)"},{"id":363,"label":"长安府府太爷","x":1579,"y":2423,"size":66,"scale":"1.3","color":"rgb(7,185,33)"},{"id":364,"label":"尤氏","x":-28,"y":1374,"size":66,"scale":"1.7","color":"rgb(213,166,146)"},{"id":365,"label":"尤老娘","x":-468,"y":1047,"size":66,"scale":"1.5","color":"rgb(213,166,146)"},{"id":366,"label":"贾蔷","x":165,"y":1095,"size":66,"scale":"1.4","color":"rgb(74,107,80)"},{"id":367,"label":"龄官","x":276,"y":1223,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":368,"label":"佩凤","x":756,"y":1350,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":369,"label":"贾珍","x":530,"y":1248,"size":66,"scale":"1.9","color":"rgb(213,166,146)"},{"id":370,"label":"偕鸾","x":590,"y":1566,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":371,"label":"文花","x":721,"y":1487,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":372,"label":"茄官","x":11,"y":1641,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":373,"label":"银蝶","x":-114,"y":1721,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":374,"label":"炒豆儿","x":-170,"y":1567,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":375,"label":"秦可卿","x":1075,"y":2037,"size":66,"scale":"1.6","color":"rgb(213,166,146)"},{"id":376,"label":"贾蓉","x":901,"y":1685,"size":66,"scale":"1.6","color":"rgb(213,166,146)"},{"id":377,"label":"许氏","x":871,"y":1903,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":378,"label":"入画","x":426,"y":2112,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":379,"label":"彩屏","x":203,"y":2204,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":380,"label":"彩儿","x":44,"y":2132,"size":66,"scale":"1.3","color":"rgb(74,107,80)"},{"id":381,"label":"瑞珠","x":1277,"y":2100,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":382,"label":"宝珠","x":1221,"y":2248,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":383,"label":"秦钟","x":995,"y":2463,"size":66,"scale":"1.4","color":"rgb(167,216,76)"},{"id":384,"label":"秦业","x":1026,"y":2266,"size":66,"scale":"1.4","color":"rgb(167,216,76)"},{"id":385,"label":"寿儿","x":501,"y":1438,"size":66,"scale":"1.3","color":"rgb(213,166,146)"},{"id":386,"label":"尤三姐","x":-846,"y":1210,"size":66,"scale":"1.4","color":"rgb(213,166,146)"},{"id":387,"label":"柳湘莲","x":-1112,"y":1394,"size":66,"scale":"1.4","color":"rgb(213,166,146)"},{"id":388,"label":"杏奴","x":-1276,"y":1556,"size":66,"scale":"1.3","color":"rgb(213,166,146)"}],"links":[{"source":1,"target":2,"label":"子"},{"source":3,"target":2,"label":"重孙媳妇"},{"source":4,"target":1,"label":"妻"},{"source":5,"target":1,"label":"妾"},{"source":6,"target":1,"label":"女"},{"source":7,"target":8,"label":"妾"},{"source":9,"target":8,"label":"妾"},{"source":10,"target":8,"label":"妾"},{"source":11,"target":8,"label":"女"},{"source":12,"target":13,"label":"妾"},{"source":14,"target":13,"label":"妾"},{"source":15,"target":13,"label":"子"},{"source":16,"target":17,"weight":2,"label":"妾"},{"source":18,"target":17,"label":"妾"},{"source":19,"target":17,"label":"妾"},{"source":20,"target":21,"label":"妻"},{"source":22,"target":21,"label":"妾"},{"source":23,"target":21,"label":"子"},{"source":24,"target":3,"label":"子"},{"source":25,"target":26,"label":"姐夫"},{"source":27,"target":25,"label":"父亲"},{"source":28,"target":25,"label":"母亲"},{"source":29,"target":30,"label":"母亲"},{"source":31,"target":32,"label":"妹"},{"source":33,"target":32,"label":"弟"},{"source":34,"target":32,"label":"老亲"},{"source":35,"target":32,"label":"兄"},{"source":36,"target":34,"label":"女"},{"source":37,"target":35,"label":"女"},{"source":38,"target":39,"label":"弟媳"},{"source":40,"target":38,"label":"弟"},{"source":41,"target":38,"label":"女"},{"source":42,"target":43,"weight":2,"label":"夫"},{"source":44,"target":45,"label":"子"},{"source":46,"target":44,"label":"妻"},{"source":47,"target":44,"label":"女"},{"source":48,"target":44,"label":"女"},{"source":49,"target":44,"label":"女"},{"source":50,"target":51,"label":"母亲"},{"source":52,"target":51,"label":"兄"},{"source":53,"target":54,"label":"夫"},{"source":55,"target":56,"label":"父亲"},{"source":57,"target":56,"label":"祖父"},{"source":58,"target":56,"label":"子"},{"source":59,"target":26,"label":"乳母"},{"source":60,"target":17,"label":"奴仆"},{"source":61,"target":17,"label":"奴仆"},{"source":62,"target":17,"label":"奴仆"},{"source":63,"target":17,"label":"奴仆"},{"source":64,"target":17,"label":"乳母"},{"source":65,"target":64,"label":"子"},{"source":66,"target":64,"label":"子"},{"source":67,"target":17,"label":"奴仆"},{"source":68,"target":17,"label":"奴仆"},{"source":69,"target":17,"label":"奴仆"},{"source":70,"target":16,"weight":2,"label":"丫鬟"},{"source":71,"target":11,"label":"乳母"},{"source":72,"target":71,"label":"子媳"},{"source":73,"target":11,"label":"丫鬟"},{"source":74,"target":11,"label":"丫鬟"},{"source":75,"target":11,"label":"丫鬟"},{"source":76,"target":75,"label":"男友"},{"source":77,"target":78,"label":"乳母"},{"source":79,"target":37,"label":"丫鬟"},{"source":80,"target":81,"label":"奶妈"},{"source":82,"target":83,"label":"丫鬟"},{"source":84,"target":83,"label":"丫鬟"},{"source":85,"target":86,"label":"丫鬟"},{"source":87,"target":21,"label":"乳母"},{"source":64,"target":21,"label":"乳母"},{"source":88,"target":21,"label":"乳母"},{"source":89,"target":21,"label":"奴仆"},{"source":90,"target":21,"label":"奴仆"},{"source":91,"target":21,"label":"奴仆"},{"source":92,"target":21,"label":"奴仆"},{"source":93,"target":21,"label":"奴仆"},{"source":94,"target":21,"label":"奴仆"},{"source":95,"target":21,"label":"奴仆"},{"source":96,"target":21,"label":"奴仆"},{"source":97,"target":21,"label":"奴仆"},{"source":98,"target":21,"label":"奴仆"},{"source":99,"target":21,"label":"奴仆"},{"source":100,"target":90,"label":"母亲"},{"source":101,"target":87,"label":"子"},{"source":102,"target":21,"label":"奴仆"},{"source":103,"target":21,"label":"奴仆"},{"source":104,"target":21,"label":"奴仆"},{"source":105,"target":21,"label":"奴仆"},{"source":106,"target":107,"label":"奴仆"},{"source":108,"target":106,"label":"女"},{"source":109,"target":106,"label":"女婿"},{"source":110,"target":106,"label":"子"},{"source":111,"target":106,"label":"干儿子"},{"source":112,"target":107,"label":"丫鬟"},{"source":113,"target":107,"label":"丫鬟"},{"source":114,"target":107,"label":"丫鬟"},{"source":115,"target":107,"label":"丫鬟"},{"source":116,"target":107,"label":"丫鬟"},{"source":117,"target":107,"label":"丫鬟"},{"source":118,"target":112,"label":"母亲"},{"source":118,"target":113,"label":"母亲"},{"source":119,"target":120,"label":"母亲"},{"source":121,"target":120,"label":"妹"},{"source":122,"target":12,"label":"丫鬟"},{"source":123,"target":12,"label":"丫鬟"},{"source":124,"target":12,"label":"兄"},{"source":125,"target":12,"label":"表兄"},{"source":125,"target":126,"label":"奴仆"},{"source":127,"target":128,"label":"丫鬟"},{"source":129,"target":128,"label":"乳母"},{"source":130,"target":128,"label":"丫鬟"},{"source":131,"target":128,"label":"丫鬟"},{"source":132,"target":128,"label":"丫鬟"},{"source":133,"target":134,"label":"母亲"},{"source":135,"target":134,"label":"子"},{"source":136,"target":134,"label":"女"},{"source":137,"target":138,"label":"奴仆"},{"source":139,"target":138,"label":"丫鬟"},{"source":140,"target":138,"label":"奴仆"},{"source":141,"target":138,"label":"丫鬟"},{"source":142,"target":138,"label":"丫鬟"},{"source":143,"target":138,"label":"丫鬟"},{"source":144,"target":143,"label":"父亲"},{"source":145,"target":32,"label":"奴仆"},{"source":146,"target":32,"label":"丫鬟"},{"source":147,"target":4,"label":"丫鬟"},{"source":148,"target":4,"label":"丫鬟"},{"source":149,"target":4,"label":"丫鬟"},{"source":150,"target":4,"label":"丫鬟"},{"source":151,"target":4,"label":"丫鬟"},{"source":152,"target":4,"label":"丫鬟"},{"source":153,"target":4,"label":"丫鬟"},{"source":154,"target":155,"label":"母亲"},{"source":156,"target":157,"label":"父亲"},{"source":158,"target":157,"label":"兄"},{"source":159,"target":160,"label":"表哥"},{"source":161,"target":160,"label":"舅"},{"source":162,"target":159,"label":"妻"},{"source":163,"target":160,"label":"表兄"},{"source":164,"target":21,"label":"丫鬟"},{"source":165,"target":21,"label":"丫鬟"},{"source":166,"target":21,"label":"丫鬟"},{"source":167,"target":21,"label":"丫鬟"},{"source":168,"target":21,"label":"丫鬟"},{"source":169,"target":21,"label":"丫鬟"},{"source":170,"target":21,"label":"丫鬟"},{"source":171,"target":21,"label":"丫鬟"},{"source":172,"target":21,"label":"丫鬟"},{"source":173,"target":21,"label":"丫鬟"},{"source":174,"target":21,"label":"丫鬟"},{"source":175,"target":21,"label":"丫鬟"},{"source":176,"target":21,"label":"丫鬟"},{"source":177,"target":21,"label":"丫鬟"},{"source":178,"target":179,"label":"母亲"},{"source":180,"target":179,"label":"妹"},{"source":181,"target":179,"label":"侄"},{"source":182,"target":54,"label":"丫鬟"},{"source":183,"target":54,"label":"丫鬟"},{"source":184,"target":54,"label":"丫鬟"},{"source":185,"target":54,"label":"丫鬟"},{"source":186,"target":177,"label":"母亲"},{"source":186,"target":187,"label":"干娘"},{"source":188,"target":177,"label":"妹"},{"source":189,"target":177,"label":"姨妈"},{"source":189,"target":132,"label":"干娘"},{"source":189,"target":185,"label":"外祖母"},{"source":190,"target":21,"label":"朋友"},{"source":191,"target":13,"label":"门生"},{"source":192,"target":193,"label":"妹"},{"source":194,"target":195,"label":"父亲"},{"source":196,"target":195,"label":"子"},{"source":197,"target":196,"label":"妻"},{"source":198,"target":196,"label":"嫔妃"},{"source":199,"target":196,"label":"子"},{"source":86,"target":199,"label":"妃"},{"source":200,"target":199,"label":"妃"},{"source":201,"target":199,"label":"妃"},{"source":202,"target":201,"label":"父亲"},{"source":203,"target":200,"label":"父亲"},{"source":204,"target":199,"label":"臣"},{"source":205,"target":199,"label":"臣"},{"source":206,"target":207,"weight":2,"label":"子"},{"source":208,"target":207,"weight":2,"label":"奴仆"},{"source":209,"target":206,"weight":2,"label":"子"},{"source":210,"target":206,"weight":2,"label":"子"},{"source":211,"target":210,"label":"女"},{"source":212,"target":213,"label":"子"},{"source":214,"target":212,"label":"子"},{"source":215,"target":212,"label":"子"},{"source":216,"target":212,"label":"儿媳"},{"source":217,"target":215,"label":"妻"},{"source":218,"target":216,"label":"女"},{"source":219,"target":218,"label":"夫"},{"source":220,"target":218,"label":"丫鬟"},{"source":221,"target":218,"label":"丫鬟"},{"source":222,"target":218,"label":"乳母"},{"source":223,"target":224,"label":"子"},{"source":225,"target":223,"label":"子"},{"source":226,"target":223,"label":"子"},{"source":227,"target":223,"label":"子"},{"source":107,"target":223,"label":"女"},{"source":228,"target":223,"label":"女"},{"source":229,"target":223,"label":"侄"},{"source":230,"target":225,"label":"妻"},{"source":231,"target":225,"label":"子"},{"source":138,"target":225,"label":"女"},{"source":232,"target":226,"label":"妻"},{"source":233,"target":226,"label":"女"},{"source":234,"target":233,"label":"夫"},{"source":235,"target":229,"label":"子"},{"source":236,"target":235,"label":"子"},{"source":237,"target":236,"label":"妻"},{"source":238,"target":236,"label":"女"},{"source":239,"target":236,"label":"子"},{"source":240,"target":237,"label":"母亲"},{"source":241,"target":242,"label":"子"},{"source":243,"target":241,"label":"子"},{"source":244,"target":241,"label":"子"},{"source":228,"target":243,"label":"妻"},{"source":245,"target":243,"label":"女"},{"source":246,"target":243,"label":"子"},{"source":247,"target":228,"label":"丫鬟"},{"source":248,"target":228,"label":"丫鬟"},{"source":249,"target":245,"label":"丫鬟"},{"source":250,"target":245,"label":"丫鬟"},{"source":251,"target":245,"label":"丫鬟"},{"source":252,"target":245,"label":"丫鬟"},{"source":253,"target":246,"label":"妻"},{"source":254,"target":246,"label":"乳父"},{"source":255,"target":253,"label":"丫鬟"},{"source":256,"target":253,"label":"丫鬟"},{"source":257,"target":253,"label":"母亲"},{"source":258,"target":257,"label":"子"},{"source":259,"target":260,"label":"丫鬟"},{"source":261,"target":244,"label":"妻"},{"source":262,"target":244,"label":"子"},{"source":263,"target":244,"label":"女"},{"source":264,"target":262,"label":"妻"},{"source":265,"target":263,"label":"夫"},{"source":266,"target":263,"label":"丫鬟"},{"source":267,"target":263,"label":"丫鬟"},{"source":268,"target":265,"label":"父亲"},{"source":269,"target":270,"label":"子"},{"source":271,"target":269,"label":"妻"},{"source":272,"target":269,"label":"子"},{"source":273,"target":274,"label":"子"},{"source":275,"target":274,"label":"女"},{"source":276,"target":277,"label":"子"},{"source":278,"target":277,"label":"女"},{"source":279,"target":280,"label":"子"},{"source":281,"target":280,"label":"兄弟"},{"source":282,"target":279,"label":"丫鬟"},{"source":283,"target":284,"label":"妻"},{"source":285,"target":284,"label":"女"},{"source":286,"target":284,"label":"友人"},{"source":287,"target":281,"label":"妻"},{"source":288,"target":281,"label":"女"},{"source":289,"target":281,"label":"邻居"},{"source":290,"target":281,"label":"伙计"},{"source":291,"target":292,"label":"子"},{"source":293,"target":294,"label":"妻"},{"source":295,"target":293,"label":"嫂"},{"source":296,"target":295,"label":"子"},{"source":297,"target":298,"label":"妻"},{"source":299,"target":298,"label":"子"},{"source":300,"target":298,"label":"子"},{"source":301,"target":298,"label":"友人"},{"source":302,"target":298,"label":"友人"},{"source":303,"target":300,"label":"妻"},{"source":304,"target":305,"label":"子"},{"source":306,"target":307,"label":"妻"},{"source":308,"target":307,"label":"孙子"},{"source":309,"target":310,"label":"孙子"},{"source":311,"target":310,"label":"妻"},{"source":312,"target":313,"label":"儿媳"},{"source":314,"target":315,"label":"妻"},{"source":316,"target":315,"label":"臣"},{"source":317,"target":318,"label":"妻"},{"source":319,"target":318,"label":"子"},{"source":320,"target":318,"label":"孙子"},{"source":321,"target":322,"label":"孙子"},{"source":323,"target":324,"label":"孙子"},{"source":325,"target":326,"label":"孙子"},{"source":327,"target":328,"label":"孙子"},{"source":329,"target":330,"label":"妻"},{"source":331,"target":330,"label":"孙子"},{"source":332,"target":333,"label":"孙子"},{"source":334,"target":335,"label":"孙子"},{"source":336,"target":337,"label":"孙子"},{"source":338,"target":339,"label":"孙子"},{"source":340,"target":341,"label":"妻"},{"source":342,"target":341,"label":"子"},{"source":343,"target":344,"label":"子"},{"source":345,"target":346,"label":"施主"},{"source":252,"target":347,"label":"徒弟"},{"source":132,"target":348,"label":"徒弟"},{"source":349,"target":350,"label":"徒弟"},{"source":351,"target":350,"weight":2,"label":"徒弟"},{"source":352,"target":350,"weight":2,"label":"徒弟"},{"source":353,"target":350,"label":"施主"},{"source":354,"target":350,"label":"施主"},{"source":355,"target":350,"label":"施主"},{"source":356,"target":350,"label":"施主"},{"source":357,"target":350,"label":"施主"},{"source":164,"target":358,"label":"徒弟"},{"source":359,"target":357,"label":"女"},{"source":360,"target":359,"label":"雇主"},{"source":361,"target":360,"label":"父亲"},{"source":362,"target":363,"label":"小舅子"},{"source":364,"target":365,"label":"女"},{"source":366,"target":207,"label":"玄孙"},{"source":367,"target":366,"label":"女友"},{"source":368,"target":369,"label":"妾"},{"source":370,"target":369,"label":"妾"},{"source":371,"target":369,"label":"妾"},{"source":372,"target":364,"label":"丫鬟"},{"source":373,"target":364,"label":"丫鬟"},{"source":374,"target":364,"label":"丫鬟"},{"source":375,"target":376,"label":"妻"},{"source":295,"target":376,"label":"续弦"},{"source":377,"target":376,"label":"续弦"},{"source":378,"target":211,"label":"丫鬟"},{"source":379,"target":211,"label":"丫鬟"},{"source":380,"target":211,"label":"丫鬟"},{"source":381,"target":375,"label":"丫鬟"},{"source":382,"target":375,"label":"丫鬟"},{"source":383,"target":384,"label":"子"},{"source":349,"target":383,"label":"女友"},{"source":350,"target":349,"label":"师父"},{"source":251,"target":369,"label":"奴仆"},{"source":385,"target":369,"label":"奴仆"},{"source":386,"target":387,"label":"女友"},{"source":388,"target":387,"label":"奴仆"},{"source":207,"target":2,"label":"兄"},{"source":8,"target":1,"label":"子"},{"source":13,"target":1,"label":"子"},{"source":6,"target":13,"label":"妹"},{"source":32,"target":8,"label":"妻"},{"source":17,"target":8,"label":"子"},{"source":78,"target":8,"label":"子"},{"source":107,"target":13,"label":"妻"},{"source":86,"target":13,"label":"女"},{"source":21,"target":13,"label":"子"},{"source":54,"target":13,"label":"女"},{"source":126,"target":13,"label":"子"},{"source":138,"target":17,"label":"妻"},{"source":26,"target":17,"label":"女"},{"source":81,"target":15,"label":"子"},{"source":83,"target":15,"label":"妻"},{"source":30,"target":11,"label":"夫"},{"source":39,"target":83,"label":"父亲"},{"source":43,"target":38,"label":"女"},{"source":42,"target":44,"label":"子"},{"source":56,"target":6,"label":"夫"},{"source":128,"target":56,"label":"女"},{"source":129,"target":21,"label":"乳母"},{"source":120,"target":107,"label":"丫鬟"},{"source":155,"target":4,"label":"丫鬟"},{"source":160,"target":21,"label":"丫鬟"},{"source":79,"target":21,"label":"丫鬟"},{"source":179,"target":21,"label":"丫鬟"},{"source":369,"target":210,"label":"子"},{"source":4,"target":213,"label":"女"},{"source":260,"target":246,"label":"妾"},{"source":284,"target":279,"label":"友人"},{"source":315,"target":313,"label":"孙子"},{"source":364,"target":369,"label":"妻"},{"source":16,"target":365,"label":"女"},{"source":386,"target":365,"label":"女"},{"source":376,"target":369,"label":"子"},{"source":375,"target":384,"label":"女"}]},
};

//初始化图客户端对象，用于操作及调用接口
function initVisGraph(visDomId){
	//定义节点的右键菜单项，自己组织界面元素，及事件操作，该方法中会注入图客户端及对应操作元素
	//示例如下，必须实现以下三个方法:init,show,hide
	var NodeRightMenu = {
	  init : function(_graph){
	      $("#graph-panel-wrapper").append("<menu>...</menu>");
	      $("#graph-panel-wrapper").on('click','#contextMenu .menu-btn',function(){

	      });
	  },
	  show : function(e,_graph){
	     this.init(_graph);
	     $("#contextMenu").css({top: e.pageY-30,left: e.pageX}).show();
	  },
	  hide : function(){
	     $("#contextMenu").hide();
	  }
	};

	//连线的右键菜单操作
	var LinkRightMenu = {
	  init : function(_graph,link){
	  	//自定义右键菜单界面元素
	  },
	  show : function(e,_graph,link){},
	  hide : function(){}
	};

	//创建图对象，参数一:图层包裹元素, 参数二:图中元素显示配置项
	var _visGraph = new VisGraph(document.getElementById(visDomId),
		{
            node:{ //节点的默认配置
                label:{ //标签配置
                    show:true, //是否显示
                    color:'50,50,50',//字体颜色
                    font:'bold 13px 微软雅黑',//字体大小及类型
                    wrapText:false, //节点包裹文字
                    textPosition:'Middle_Center',//文字位置 Top_Center,Bottom_Center,Middle_Right
					//textOffsetX:-24,//文字横向偏移量
					//textOffsetY:-24,//文字纵向偏移量
					//backgroud:'255,255,255',//文字背景色
					//borderWidth:0,//文字边框宽度
					//borderColor:'250,250,250'//文字边框颜色
                },
                shape:'circle',//节点形状 circle,rect,square,ellipse,triangle,star,polygon,text
                //image:'images/T1030001.svg',//节点图标(设置后节点显示为圆形图标)
                color:'20,20,200',//节点颜色
				borderColor:'255,255,255',//边框颜色
				borderWidth:2,//边框宽度,
				borderRadius:0,//边框圆角大小
				lineDash:[0],//边框虚线间隔,borderWidth>0时生效
                alpha:1,//节点透明度
                size:60, //节点默认大小
                width:80, //节点的长度(shape为rect生效)
                height:40,//节点的高度(shape为rect生效)
                selected:{ //选中时的样式设置
					borderColor:'50,120,230',//选中时边框颜色
					borderAlpha:1,//选中时的边框透明度
					borderWidth:8,//选中是的边框宽度
					showShadow:false,//是否展示阴影
                	shadowColor:'50,100,250'//选中是的阴影颜色
				},
                onClick : function(event,node){ //节点点击事件回调
                    console.log('点击节点----['+node.id+':'+node.label+']');
                },
                ondblClick:function(event,node){console.log('双击节点');},//节点双击事件
                onMouseDown:function(event,node){console.log('鼠标按下节点');},//节点的鼠标按下事件
                onMouseUp:function(event,node){console.log('鼠标弹起节点');},//节点的鼠标弹起事件
                onMouseOver:function(event,node){console.log('鼠标移入节点');},//节点的鼠标划过事件
                onMouseOut:function(event,node){console.log('鼠标移出节点');},//节点的鼠标划出事件
                onMousedrag:function(event,node){console.log('拖动节点');}//节点的拖拽移动事件
            },
            link:{ //连线的默认配置
                label:{ //连线标签
                    show:true, //是否显示
                    color:'50,50,50', //字体颜色
                    font:'normal 12px 微软雅黑'//字体大小及类型
                },
				lineType:'direct',//连线类型,direct,curver,vlink,hlink,bezier,vbezier,hbezier
                //colorType:'defined',//连线颜色类型 source:继承source颜色,target:继承target颜色 both:用双边颜色，defined:自定义
                color:'120,120,120', //连线颜色
                alpha:0.8,  // 连线透明度
                lineWidth:2, //连线宽度
				lineDash:[0],//虚线间隔样式如：[5,8]
				showArrow:true,//显示箭头
				selected:{ //选中时的样式设置
					color:'250,50,50',//选中时的颜色
					alpha:1,
					showShadow:false,//是否展示阴影
                	shadowColor:'250,40,30'//选中连线时的阴影颜色
				},
                onClick :function(event,link){ //连线点击事件回调
                    console.log('click link---['+link.source.id+'-->'+link.target.id+']');
                },
                ondblClick:function(event,link){}//连线的双击回调事件
            },
            highLightNeiber:false, //相邻节点高度标志
            wheelZoom:0.8,//滚轮缩放开关，不使用时不设置[0,1]
            noElementClick:function(event){//画布空白处的点击事件
            	console.log('点击了空白区域');
            },
            rightMenu:{
                nodeMenu:NodeRightMenu,  //节点右键菜单配置
                linkMenu:LinkRightMenu   // 连线右键菜单配置
            },
			/* layout:{ //开启内置力导向布局,不配置时不启动
				type:'force',
				options:{
					friction: 0.9,
					linkDistance: 150,
					linkStrength: 0.05,
					charge: -150,
					gravity: 0.01,
					noverlap:false
				}
			} */
		}
	);
	return _visGraph;
};

//加载图数据，可ajax请求服务端返回数据，格式如{nodes:[],links:[]}
function loadData(){
	return DemoDataCache['data1'];
};


//按自己需求重新设置可视化元素（点、边）的样式
function definedGraphStyle(){

	//以下为自定义设置点和边的样式（颜色、大小等等均可自定义）
	var gdata = visgraph.getGraphData();//获取绘图后的图数据

	var nodes=gdata.nodes;//获取所有点，设置点的样式
	var shapes=['circle','rect','square','ellipse','star','polygon','triangle','roundRect'];
	nodes.forEach(function(node) {
		var inDegree = (node.inLinks||[]).length; //获取节点的入度
		var outDegree = (node.outLinks||[]).length; //获取节点的出度
		//var index = Math.round(Math.random()*6);
		//node.shape = shapes[index]; //随机形状
		//对度大于3的点显示标签，设置为选中样式
		if((inDegree + outDegree) > 5){
			//node.showlabel=true;  //显示点的标签
			//node.selected=true;   //显示选中样式
			//node.borderColor=node.fillColor;//边框颜色使用自身颜色
			//node.lineDash=[5,5]; //边框虚线
			//node.setImage('images/T1030001.svg');//设置图片路径
			//node.textPosition='Bottom_Center';//标签位置
			//node.font='bold 18px 微软雅黑';//设置字体格式
			//node.borderWidth=4;//增加边框
			//node.borderColor=randomColor();//随机边框颜色
			node.showShadow=true;
			node.shadowColor='250,50,20';//显示选中阴影
			//node.showSelected=1;
			node.selectedBorderColor='250,50,20';
			node.selectedBorderAlpha=0.8;
			node.selectedBorderWidth=10;
			/* node.shape='rect';
			node.height=60;
			node.width=160; */
			//node.fillColor='255,255,255';
			//node.alpha=0.1;
			
			//node.radius=150;//设置节点大小
			//node.scaleX=1;//缩放比例
			//node.scaleY=1;//缩放比例
		}
		//node.textOffsetX=0;
		//node.textOffsetY=-16;
		//node.height=80;
		//node.width=220;
		//node.label = '姓名:'+node.label+'\n出生地:陕西省西安市\n身份证:244655555556644555789X\n生日:2020-10-10';
		
		//node.font='14px 微软雅黑'; //字体大小 类型
		//node.fontColor='50,50,50'; //点的字体颜色
		//node.textPosition='Middle_Center'; //字体位置（下方居中）
		node.scaleX=1;//缩放比例
		node.scaleY=1;//缩放比例
		//node.wrapText = true;//节点大小包裹文字
	    //node.fillColor=randomColor();//点填充颜色
	    //node.shape='star'; //点形状设置
	});


	//设置边的可视化样式
	var links = gdata.links; //获取所有边
	//console.log('边的条数='+links.length);
	links.forEach(function(link,i){
	    link.showlabel=true; //显示连线的标签
	    link.fontColor='50,50,50';//设置边的标签颜色
	    link.font='bold 12px 微软雅黑';//设置连线的粗细
		
		link.alpha=1;
	    link.lineWidth=2;//设置连线的粗细
	    //link.colorType='defined'; //连线的颜色继承源节点
	    //link.strokeColor='150,150,150'; //设置边的颜色
	    //link.strokeColor='255,255,255'; 
		//link.visible = false;

	    //link.lineType=i%4==0?'curver':'direct';
	});
};

//自定义布局算法
function initLayoutOptions(){
	var layoutTypes = [
		{
			label:'力学模型类',
			childTypes:[
				{type:'fastFR',label:'快速弹性布局'},
				{type:'frDirect',label:'弹簧力学布局'},
				{type:'fruchtermanReingold',label:'FruchReingold'},
				{type:'spring2',label:'SpringLayout'}
			]
		},
		{
			label:'关系网络类',
			childTypes:[
				{type:'fr',label:'经典网络布局'},
				{type:'kk',label:'关系路径布局'},
				{type:'arf',label:'球面网络布局'},
        		{type:'gather',label:'群组聚类布局'}
			]
		},
		{
			label:'圆形类',
			childTypes:[
				{type:'concentric',label:'中心圆形布局'},
				{type:'singleCirlce',label:'圆形布局'},
				{type:'dualCirlce',label:'双圆环布局'},
				{type:'layerCircle',label:'多层圆环布局'},
				{type:'sphere',label:'球体布局'}
			]
		},
		{
			label:'树形结构类',
			childTypes:[
				{type:'hubsize',label:'层级布局'},
				{type:'tree',label:'树形布局'},
				{type:'topoCircle',label:'雪花布局'},
				{type:'radiatree',label:'径向布局'},
				{type:'balloon',label:'圆形层级布局'}			]
		},
		{
			label:'其他布局',
			childTypes:[
				{type:'hive',label:'放射形布局'},
				{type:'layered',label:'分层布局'},
				{type:'grid',label:'矩形布局'},
				{type:'noverlap',label:'避免节点重叠'}
			]
		}
	];

	var htmlTemplates=['<select id="layoutSelector" class="select">'];
	htmlTemplates.push('<option value="">--请选择布局算法--</option>');
	layoutTypes.forEach(function(layoutType){
		htmlTemplates.push('<optgroup label="'+layoutType.label+'">');
		 
		layoutType.childTypes.forEach(function(childType){
			htmlTemplates.push('<option value="'+childType.type+'">'+childType.label+'</option>');
		});

		htmlTemplates.push('</optgroup>');
	});
	htmlTemplates.push('</select>'); 
	$('#layout-panel').html(htmlTemplates.join(''));

	$('#layoutSelector').on("change",function(){
		var layoutType=$(this).val();
		initLayoutParams(layoutType);
	});
};

//通过选中的布局算法 类型生成对应得
function initLayoutParams(layoutType){
	//创建空的布局算法，获取算法的参数配置项，来自定义设置参数
    var layout=new LayoutFactory({nodes:[],links:[]}).createLayout(layoutType);
    var configs = layout.getConfig(); //获取布局算法的参数配置项
    
    //console.log(configs); //可打印出来查看每种布局算法参数列表

    //生成算法参数的设置区域
	var html = '';
	configs.forEach(function(config){
		html+='<tr>';
		for(var param in config){
			if(param == 'label'){
				html+='<td>'+config['label']+'</td>'
			}else{
				var paramValue =config[param];
				if(paramValue instanceof Array){
					html+='<td>';
					html += '<select name="'+param+'" class="small-selector param">';
					paramValue.forEach(function(option){
						html += '<option value="'+option['value']+'">'+option['label']+'</option>';
					});
					html+='</select></td>';
				}else{
					html+='<td><input class="param" type="number" name="'+param+'" value="'+paramValue+'"></td>';
				}
			}
		}
		html+='</tr>';
	});
	$('#layout-params').html(html);
};

//绑定布局算法执行、停止、重设参数的操作事件
function bindLayoutBtnEvent(){
	$('#runLayotBtn').on('click',function(){
		var btn = $(this);
		var layoutType = $('#layoutSelector').val();
		if(!layoutType){
			return false;
		}

		if(visgraph.getGraphData().nodes.length==0){
			return false;
		}

		if(btn.hasClass('btn-success')){
			btn.removeClass('btn-success').addClass('btn-danger').html('<i class="fa fa-pause"></i>停止布局');;
	    	if(layoutType && layoutType.length > 0){
	    		runLayout(layoutType); //开始运行布局算法
	    	}
		}else{
			btn.removeClass('btn-danger').addClass('btn-success').html('<i class="fa fa-play"></i>开始布局');
			stopLayout(); //停止布局
		}
	});

	$('#layoutParam-reset').on('click',function(){
		var config = {};
		$('#layout-params .param').each(function(){
			config[$(this).attr('name')] = $(this).val();
		});
		resetLayoutConfig(config); //重设布局算法参数
	});
};

//运行布局算法过程，循环进行计算
function runLayout(layoutType){
	//1、获取显示的数据可视化图数据（隐藏的不参与计算）
	let _graph =visgraph.getVisibleData();

	//2、创建布局算法对象（通过指定类型创建）
	currentLayout = new LayoutFactory(_graph).createLayout(layoutType);

	if(currentLayout){
		//visgraph.hideAllLink();//隐藏连线，提高计算性能
		var config = {};
    	$('#layout-params .param').each(function(){
    		config[$(this).attr('name')] = $(this).val(); //获取参数名及其参数值
    	});
    	//currentLayout.initAlgo(); //初始化布局算法默认参数
    	currentLayout.resetConfig(config); //重新设置布局算法参数
    	
    	//循环运行布局算法，有动画效果，也可以使用while或者for循环一次性计算完成
    	//var q = quadtree(_graph.nodes);
    	function loop(){
    		cancelAnimationFrame(loopName);
			visgraph.refresh();
    		currentLayout.runLayout();  //运行布局算法
    		//nodeCollide(_graph.nodes,q);
    		loopName = requestAnimationFrame(loop);	    		
    	};
    	loopName = requestAnimationFrame(loop);
	}
};

//停止布局算法，保持静止
function stopLayout(layoutType){
	cancelAnimationFrame(loopName); //取消布局动画
	visgraph.translateToCenter(); //可视化数据居中展示
	//visgraph.showAllLink(); //显示所有连线
};

//重新设置布局算法参数
function resetLayoutConfig(config){
	if(currentLayout){
		currentLayout.resetConfig(config);
	}
};

//初始化聚类算法操作区域
function initClusterOptions(){
	let clusterTypes = [
		{label:'ChineseWhisper',type:'chinesewisper'},
		{label:'Louvain',type:'louvain'},
		{label:'WeakCommpent',type:'weakcommpent'},
		{label:'Bicomponent',type:'bicomponet'},
		{label:'Newman',type:'newman'},
		{label:'KMeans',type:'kmeans'}
	];

	var htmlTemplates=['<select id="clusterSelector" class="select">'];
	clusterTypes.forEach(function(clusterType){
		htmlTemplates.push('<option value="'+clusterType.type+'">'+clusterType.label+'</option>');
	});
	htmlTemplates.push('</select>'); 
	$('#cluster-panel').html(htmlTemplates.join(''));


	$('#clusterBtn').on('click',function(){
		var clusterType = $('#clusterSelector').val();
		var effectType = $('#cluster-effect').val();
		var clusterAvoid = $('#cluster-avoidlap').val();
		clusterAvoid = clusterAvoid=='true'?true:false;
		applyCluster(clusterType,effectType,clusterAvoid); //应用聚类算法
	});
};


//执行聚类算法，通过指定算法类型进行初始化操作
function applyCluster(clusterType,effectType,avoidOverlap){

	visgraph.clearClusters();//清除上一次聚类效果

	const graph = visgraph.getVisibleData();

	//1、创建社区划分算法对象
	const clusterObj = new ClusterFactory(graph).createClutser(clusterType);
    
    //2、执行社区划分算法，用颜色标识不同社区
    var clusters = clusterObj.applay();

    //3、对社区划分结果添加区域划分（可选择使用）
    if(effectType=='2'){
    	visgraph.addClusterContainer(clusters,avoidOverlap);
    }
	
	visgraph.refresh();
};


//随机颜色工具类
function randomColor(){
  return Math.floor(255 * Math.random()) + "," 
  		+ Math.floor(180 * Math.random()) + "," 
  		+ Math.floor(255 * Math.random());
};

//绑定显示设置中各个下拉框切换事件
function resetShowStyleEvent(){

	$('#node-shape').on('change',function(){
    	var type = $(this).val();
    	visgraph.setNodeShape(type);
    });

    $('#node-label').on('change',function(){
    	var type = $(this).val();
    	type = type=='true'?true:false;
    	visgraph.showNodeLabel(type);
    });

    $('#node-label-wrap').on('change',function(){
    	var type = $(this).val();
    	type = type=='true'?true:false;
    	visgraph.nodeWrapText(type);
    });

    $('#node-label-pos').on('change',function(){
    	var type = $(this).val();
    	visgraph.setTextPosition(type);
    });

	$('#link-type').on('change',function(){
    	var type = $(this).val();
    	visgraph.setLineType(type);
    });

    $('#link-dashed').on('change',function(){
    	var type = $(this).val();
    	type = type=='true'?true:false;
    	visgraph.setLineDashed(type);
    });


    $('#link-label').on('change',function(){
    	var type = $(this).val();
    	type = type=='true'?true:false;
    	visgraph.showLinkLabel(type);
    });

    $('#link-arrow').on('change',function(){
    	var type = $(this).val();
    	type = type=='true'?true:false;
    	visgraph.setLinkArrowShow(type);
    });

};

//绑定左侧工具栏操作事件
function bindLeftBarEvent(){
	$('#left-tool-btns li').on('click', function (e) {
		var target = $(this);
		var type = target.attr('type');
		var method = target.attr('method');
		if(type == 'zoom'){
			visgraph.setZoom(method);
		}else if(type == 'mode'){
			target.addClass('active').siblings('li[type="mode"]').removeClass('active');
			visgraph.setMouseModel(method);
		}else if(type == 'coordi'){
			if(method == 'east'){
	    		visgraph.rotateGraph(10);
	    	}else if(method == 'west'){
	    		visgraph.rotateGraph(-10);
	    	}else{
	    		visgraph.translateOrZoom(method,100);
	    	}
		}else if(type == 'saveImage'){
			//visgraph.saveImage(); //png|jpeg
	    	visgraph.saveImage(5000,5000,'png'); //保存图片的宽和高，图片过大时下载需要指定大小
		}else if(type == 'eyeview'){
    		if(target.find('.fa-eye').length > 0){
    			target.find("i").addClass('fa-eye-slash').removeClass("fa-eye");
    			visgraph.showOverView(true);
    		}else{
				target.find("i").addClass('fa-eye').removeClass("fa-eye-slash");
    			visgraph.showOverView(false);
    		}
		}
    });


    $('#side-bar-btn').on('click',function(){
		if($(this).hasClass('right')){
			$(this).removeClass('right').addClass('left');
			$('.right-side').animate({right:'-230px'});
		}else{
			$(this).removeClass('left').addClass('right');
			$('.right-side').animate({right:'0'});
		}
	});
};

//选择示例数据集
function bindSwitchDataEvent(){

	$('.demo-data').on('click',function(){
		var datakey = $(this).data('type');
		visgraph.drawData(DemoDataCache[datakey]);
		visgraph.setZoom('auto');
	});

};

// 模拟动态数据演示加载及添加节点等操作
function mockInteractiveData(){

	$('#interactiveBtn').on('click',function(){
		var nodeCount = Number($('#nodeCount').val());
		var childCount = Number($('#childCount').val());

		genrateGraphData(nodeCount,childCount);
	});

	//随机生成图数据
	function genrateGraphData(nodeCount,childCount){
		visgraph.clearAll(); //清理画布中所有数据，开始重新绘制

		for(var i=0;i<nodeCount;i++){
			var _node = visgraph.addNode({
				id:'id_'+i,             //节点ID
				label:'点_'+i,        //节点标签
				color:randomColor(),    //节点颜色
				size:50,                //节点大小
				x : Math.random()*600,  //x坐标值
				y : Math.random()*500,  //y坐标值
				fontColor:'220,250,250',  //字体颜色
				textPosition:'Bottom_Center', //字体位置
				cluster:'classic_id_'+i,
				properties:{  //peroper标识扩展属性，可以自定义任意信息，自己做可视化过滤或者其他展示操作用
					type:'type1',
					name:'名字',
					desc:'备注信息'
				}
			});

			//自定义单个节点的样式
			_node.wrapText=true;//节点包裹字体
			_node.font= 'bold 12px 微软雅黑';//节点字体大小

			//给节点添加子节点，并创建关系
			for(var j=0;j<childCount;j++){
				var childNodeId = i+''+j; 
				var childNode = visgraph.addNode({
					id:'id_'+childNodeId,             //节点ID
					label:'点_'+childNodeId,        //节点标签
					color:randomColor(),    //节点颜色
					size:50,                //节点大小
					fontColor:'220,250,250',  //字体颜色
					textPosition:'Middle_Center' //字体位置
				});
				childNode.font = 'normal 11px 微软雅黑';
				childNode.tipText='10'; //节点提示文字

				//绑定双击事件
				childNode.dbclick(function(event){
					searchNodeRelations(this);
					this.tipText=null;//提示消失
				});

				//添加关系连线
				var edge = visgraph.addEdge({
					source:'id_'+i, //源点的ID
					target:'id_'+childNodeId, //目标点ID
					label:'关系_'+j, //关系标签
					properties:{  //peroper标识扩展属性，可以自定义任意信息，自己做可视化过滤或者其他展示操作用
						type:'type1',
						desc:'备注信息'
					}
				});

				//自定义单个连线的样式
				if(edge != null){
					edge.lineType = j%2==0?'direct':'vdirect';//连线类型
					edge.lineWidth = 1; //连线宽度
					edge.colorType='s'; //连线颜色使用源点色
					//edge.strokeColor = '120,120,200'; //连线颜色
					edge.font= 'bola 12px 微软雅黑'; //连线字体大小
					edge.fontColor= '100,100,200';//连线字体颜色
					edge.alpha = 0.8; //连线透明度
					edge.showArrow=true;//显示箭头
				}
			}
		}

		//模拟关系，把主要节点间增加关系
		for(var k=0;k<nodeCount;k++){
			var edge = visgraph.addEdge({
				source:'id_'+k, //源点的ID
				target:'id_'+(k+1), //目标点ID
				label:'关系_'+k  //关系标签
			});

			if(edge != null){
				edge.lineType = j%2==0?'direct':'vdirect';//连线类型
				edge.lineWidth = 1; //连线宽度
				edge.colorType='s'; //连线颜色使用源点色
				//edge.strokeColor = '120,120,200'; //连线颜色
				edge.font= '10px 微软雅黑'; //连线字体大小
				edge.fontColor= '100,100,200';//连线字体颜色
				edge.alpha = 0.8; //连线透明度
				edge.showArrow=true;//显示箭头
			}
		}

		autoLayout(); //自动布局，调整效果
		visgraph.moveCenter();//移动到可视化中心
	};

	//自动布局
	function autoLayout(){
		var layout=new LayoutFactory(visgraph.getVisibleData()).createLayout("fastFR");
    	layout.initAlgo();

    	let i=0;
    	while(i++ < 300){
    		layout.runLayout(); //执行300次布局算法，调整显示效果
    	}
	};


	//查询节点关联数据，追加到图中
	function searchNodeRelations(node){
		//模拟服务端查询到的点和边
		var nodes = [],links=[];
		var num = 0;
		while(num++ < 10){
			nodes.push({
				id:'c_'+node.id+'_'+num,
				label:'子_'+num,
				color:node.fillColor,
				fontColor:node.fontColor,
				size:50,
				cluster:'classic_'+node.id
			});

			links.push({
				source:node.id,
				target:'c_'+node.id+'_'+num,
				label:'r'+num,
				weight:1,
				strokeColor:node.fillColor,
				fontColor:'100,100,220',
				lineWidth:2,
				font:'bold 10px 微软雅黑'
			});
		}
		//动态追加到图中
		visgraph.activeAddNodeLinks(nodes,links);
	};
};


//常用操作的事件,演示常用操作接口
function commonOperateEvent(){

	$('#addLink').on('click',function(){
		visgraph.begainAddLine(visgraph.currentNode);//添加连线，选中点后点击开始，可以开启连线
	});

	$('#delnode').on('click',function(){
		visgraph.deleteNode(visgraph.currentNode);//删除指定节点,以当前选中点为例
	});

	$('#dellink').on('click',function(){
		visgraph.deleteLink(visgraph.currentLink);//删除指定连线,以当前选中边为例
	});

	//节点操作的接口
	$('#nodeopts').on('change',function(){
		var operate = $(this).val();
		switch(operate){
			case 'selectAll':
				visgraph.selectAll(); //全选
				break;
			case 'reverseSelect':
				visgraph.reverseSelect(); //反选
				break;
			case 'showSelected':
				visgraph.showSelected(); //显示选中
				break;
			case 'hideSelected':
				visgraph.hideSelected(); //隐藏选中
				break;
			case 'showNodes':
				visgraph.showNodes(); //显示全部
				break;
			case 'delSelect':
				visgraph.delSelect(); //删除选中
				break;
			case 'selectRelate':
				visgraph.selectRelate(); //选择关联
				break;
			case 'hideIsolatedNodes':
				visgraph.hideIsolatedNodes(); //隐藏孤立点
				break;
			default:
				break;
		}
	});

	//连线操作的接口
	$('#linkopts').on('change',function(){
		var operate = $(this).val();
		switch(operate){
			case 'showAllLink':
				visgraph.showAllLink(); //显示全部
				break;
			case 'hideAllLink':
				visgraph.hideAllLink(); //隐藏全部
				break;
			default:
				break;
		}
	});

	$('#searchNode').on('click',function(){
		var nodeName = $.trim($('#nodeName').val());
		var node = visgraph.findNode(nodeName);
		$('#nodeInfo').val(JSON.stringify({id:node.id,label:node.label,type:node.type,x:node.x,y:node.y,properties:node.properties}));
    });

    $('#findPath').on('click',function(){
        var soureNode = $.trim($('#soureNode').val());
        var targetNode = $.trim($('#targetNode').val());
        visgraph.pathAnalyze(soureNode,targetNode);
        //visgraph.findShortPath(soureNode,targetNode);
    });


};

